--[[
	JewelTips 0.7.0
]]--


--Create Jeweltips frame
JewelTips = {}
local JewelTips = JewelTips

JewelTips.Jewels = {
--kptit 2012.9.22 于重庆璧山县
--=================== 药剂+强化药水 ===================--
	[25] = 3824, --暗影之油 附加在近战武器上，可以使其在击中敌人时有15%的几率对其施放暗影箭（等级 3）。持续30分钟。不能对等级高于165的物品使用
	[26] = 3829, --冰霜之油 涂在近战武器上之后，有10%的几率在击中敌人时施放寒冰箭。持续30分钟	
	[2623] = 20744, --初级巫师之油 武器法术强度+8
	[2624] = 20745, --初级法力之油 武器每5秒回复法力+4	
	[2626] = 20746, --次级巫师之油 武器法术强度+16
	[2625] = 20747, --次级法力之油 武器每5秒回复法力+8
	[2628] = 20749, --卓越巫师之油  武器法术强度+36 暴击等级+14
	[2629] = 20748, --卓越法力之油 武器每5秒回复法力+12 法术强度+13
	[2627] = 20750, --巫师之油 武器法术强度+24
	[3592] = 23123, --神圣巫师之油  使用在武器上，使你的法术对亡灵的伤害提高最多100点，持续1小时。不能对等级高于165的物品使用
	[2678] = 22522, --超级巫师之油  涂抹在目标武器上之后，使持有者的法术强度提高42点，持续1小时。不能对等级高于165的物品使用
	[2677] = 22521, --超级法力之油 涂抹在目标武器上之后，每5秒为持有者回复14点法力值，持续1小时。不能对等级高于165的物品使用
--=================== 术士火焰石 ===================--
    [3614] = 41174, --完美火焰石 附加在武器上，使其获得直接伤害法术造成的伤害提高1%、法术爆击等级提高49的效果，持续1小时
	[3613] = 41173, --邪能火焰石  附加在武器上，使其获得直接伤害法术造成的伤害提高1%、法术爆击等级提高42的效果，持续1小时。另外，每次攻击都有一定几率附加1点火焰伤害。
	[3597] = 40773, --特效火焰石 附加在武器上，使其获得直接伤害法术造成的伤害提高1%、法术爆击等级提高35的效果，持续1小时
	[3612] = 41172, --极效火焰石 附加在武器上，使其获得直接伤害法术造成的伤害提高1%、法术爆击等级提高28的效果，持续1小时
	[3611] = 41171, --强效火焰石  附加在武器上，使其获得直接伤害法术造成的伤害提高1%、法术爆击等级提高21的效果，持续1小时。
	[3610] = 41169, --火焰石 附加在武器上，使其获得直接伤害法术造成的伤害提高1%、法术爆击等级提高14的效果，持续1小时
	[3609] = 41170, --次级火焰石 附加在武器上，使其获得直接伤害法术造成的伤害提高1%、法术爆击等级提高7的效果，持续1小时
--=================== DK专用附魔 ===================--
    [3368] = {GetSpellInfo(53344), 53344}, --堕落十字军符文 为你的符文武器添加一枚符文，使你有一定几率在攻击时恢复3%的生命值，并使力量总值提高15%，持续15秒
	[3366] = {GetSpellInfo(53331), 53331}, --巫妖斩除符文 为你的符文武器添加一枚符文，使你在攻击时造成相当于武器伤害2%的额外火焰伤害，或对亡灵造成4%的附加伤害
	[3367] = {GetSpellInfo(53342), 53342}, --法术碎裂符文 为你的双手符文武器添加一枚符文，使你受到的所有法术伤害的4%被偏转，沉默效果持续时间缩短50%
	[3595] = {GetSpellInfo(54447), 54447}, --法术阻断符文 为你的单手符文武器添加一枚符文，使你受到的所有法术伤害的2%被偏转，沉默效果持续时间缩短50%（不与其他缩短沉默持续时间的效果叠加）
	[3369] = {GetSpellInfo(53341), 53341}, --灰烬冰河符文 为你的符文武器添加一枚符文，使你有一定几率获得下两次冰霜和暗影系攻击伤害提高20%的效果
	[3847] = {GetSpellInfo(62158), 62158}, --石肤石像鬼符文 为你的双手符文武器添加一枚符文，使你的防御值提高25点，耐力总值提高2%
	[3594] = {GetSpellInfo(54446), 54446}, --破刃符文 为你的单手符文武器添加一枚符文，使你的招架几率提高2%，缴械效果持续时间缩短50%
	[3883] = {GetSpellInfo(70164), 70164}, --蛛魔甲壳符文 为你的符文武器添加一枚符文，使你的防御提高13点，总耐力值提高1%
	[3365] = {GetSpellInfo(53323), 53323}, --裂刃符文 为你的双手符文武器添加一枚符文，使你的招架几率提高4%，缴械效果持续时间缩短50%
	[3370] = {GetSpellInfo(53343), 53343}, --冰锋符文 在死亡骑士的符文武器上增加一个符文，使你在攻击时造成相当于武器伤害2%的额外冰霜伤害，并提高目标在受到你冰霜攻击时所承受的伤害
--=================== 渔线 ===================--
    [263] = 6529,   --闪光的小珠 装备在鱼竿上之后，可以使你的钓鱼技能提高25点，持续10分钟
    [264] = 6530,	--夜色虫 装备在鱼竿上之后，可以使你的钓鱼技能提高50点，持续10分钟
	[265] = 6532,	--明亮的小珠 装备在鱼竿上之后，可以使你的钓鱼技能提高75点，持续10分钟
	[266] = 6533,	--水下诱鱼器 装备在鱼竿上之后，可以使你的钓鱼技能提高100点，持续10分钟
	[266] = 34861,	--锐利的鱼钩 附在鱼竿上，可以使钓鱼技能提高100点，持续10分钟
	[265] = 33820,	--饱经风霜的渔帽 在你的鱼竿上附加一份鱼饵，使钓鱼技能提高75点，持续10分钟
	[3868] = 46006,	--发光的虫子 装备在鱼竿上之后，可以使你的钓鱼技能提高100点，持续1小时
    [3269] = 34836, --spell=45697真银渔线+3 将你的鱼竿上的渔线更换为精巧的真银渔线，使钓鱼技能提高3点
	--原2012.9.25改 [2603] = 19971, --高强度恒金渔线+5  (特注明: 3.3.5版暴雪自己的错误,导致本该钓鱼技能+5,却错显示成+2了)
	[846] = 19971, --高强度恒金渔线+5  (特注明: 3.3.5版暴雪自己的错误,导致本该钓鱼技能+5,却错显示成+2了)
	
--=================== 阵营附魔 ===================--
--=== 地球时代 ===--
 --赞达拉部族
	[2583] = 19782, --ZS力量的证明19782 永久性地为一件头部或腿部装备提供耐力+10，防御等级+10，盾牌格挡值+30的属性
	[2584] = 19783, --SQ调和的徽记19783  永久性地为一件头部或腿部装备提供耐力提高10点、防御等级提高10、法术强度提高12点的属性
	[3755] = 19784, --DZ死亡的拥抱19784 永久性地为一件头部或腿部装备提供+28点攻击强度和躲闪等级+12的属性
	[3754] = 19785, --LR猎鹰的召唤19785 永久性地为一件头部或腿部装备提供攻击强度+24，耐力+10，命中等级+10的属性
	[2587] = 19786, --SM巫毒的警觉19786 永久性地为一件头部或腿部装备提供法术强度提高13点、智力提高15点的属性
	[2588] = 19787, --FS魔法的视域19787 永久性地为一件头部或腿部装备提供法术强度提高18点、法术命中等级提高8的属性
	[2589] = 19788, --SS不祥的妖术19788 永久性地为一件头部或腿部装备提供耐力提高10点、法术强度提高18点的属性
	[2590] = 19789, --MS预言的光环19789 永久性地为一件头部或腿部装备提供耐力提高10点、每5秒回复5点法力值、法术强度提高13点的属性
	[2591] = 19790, --XD灵魂的安抚19790 永久性地为一件头部或腿部装备提供耐力提高10点、智力提高10点、法术强度提高12点的属性
	--[2681] = 22635, --野性戒卫22635 给你的头部或腿部装备附加魔法效果，使自然抗性提高10点。无法与其它附加于指定装备的魔法效果重叠
 --辛德拉
	[2543] = 18329, --急速秘药18329 永久性地为一件头部或腿部装备附加魔法效果，使其急速等级提高10
	[2544] = 18330, --专注秘药18330 给你的头部或腿部装备附加魔法效果，使法术强度提高8点
	[2545] = 18331, --防护秘药 18331给你的头部或腿部装备附加魔法效果，使躲闪等级提高12
    [1506] = 11645, --次级贪婪秘药11645 给你的头部或腿部装备附加魔法效果，使力量提高8点
	--[1505] = 11644, --次级适应秘药11644 给你的头部或腿部装备附加魔法效果，使火焰抗性提高20点
	[1504] = 11643, --次级坚韧秘药11643 给你的头部或腿部装备附加魔法效果，使护甲值提高125点
	[1503] = 11642, --次级体质秘药11642 给你的头部或腿部装备附加魔法效果，使生命值提高100点
	[1483] = 11622, --次级冥思秘药11622 给你的头部或腿部装备附加魔法效果，使法力值提高150点
 --银色黎明	
	--[2488] = 18182, --多彩黎明衬肩18182 给你的护肩附加魔法效果，使所有魔法抗性提高5点
	
--=== TBC ===--
 --奥尔多
	[2982] = 28886, --奥尔多 强力戒律铭文 永久性地为一件肩部装备附加法术强度提高18点、爆击等级提高10的效果
	[2980] = 28887, --奥尔多 强力信仰铭文 永久性地为一件肩部装备附加法术强度提高18点、每5秒恢复5点法力值的效果
	[2986] = 28888, --奥尔多 强力复仇铭文 永久性地为一件肩部装备附加攻击强度提高30点、爆击等级提高10的效果
	[2978] = 28889, --奥尔多 强力护卫铭文 永久性地为一件肩部装备附加躲闪等级提高15、防御等级提高10的效果
	[2981] = 28881, --奥尔多 戒律铭文 永久性地为一件肩部装备附加法术强度提高15点的效果
	[2979] = 28878, --奥尔多 信仰铭文 永久性地为一件肩部装备附加法术强度提高15点的效果
	[2983] = 28885, --奥尔多 复仇铭文 永久性地为一件肩部装备附加攻击强度提高26点的效果
	[2977] = 28882, --奥尔多 护卫铭文 永久性地为一件肩部装备附加躲闪等级提高13的效果
 --占星者
	[2995] = 28909, --占星者 强力宝珠铭文 永久性地为一件肩部装备附加爆击等级提高15、法术强度提高12点的效果
    [2997] = 28910, --占星者 强力利刃铭文 永久性地为一件肩部装备附加爆击等级提高15、攻击强度提高20点的效果
    [2991] = 28911, --占星者 强力骑士铭文 永久性地为一件肩部装备附加躲闪等级提高10、防御等级提高15的效果
    [2993] = 28912, --占星者 强力神谕铭文 永久性地为一件肩部装备附加每5秒恢复8点法力值、法术强度提高12点的效果
	[2994] = 28903, --占星者 宝珠铭文 永久性地为一件肩部装备附加爆击等级提高13的效果
	[2996] = 28907, --占星者 利刃铭文 永久性地为一件肩部装备附加爆击等级提高13的效果
	[2990] = 28908, --占星者 骑士铭文 永久性地为一件肩部装备附加防御等级提高13的效果
	[2992] = 28904, --占星者 神谕铭文 永久性地为一件肩部装备附加每5秒恢复6点法力值的效果
 --塞纳里奥远征队
	--[3005] = 29194, --自然防护秘药29194 永久性地为一件头部装备附加自然抗性提高20点的效果
	[3003] = 29192, --凶暴秘药29192 永久性地为一件头部装备附加攻击强度提高34点、命中等级提高16的效果
 --时光守护者
	--[3008] = 29198, --冰霜防护秘药29198 永久性地为一件头部装备附加冰霜抗性提高20点的效果
	[2999] = 29186, --防御者秘药29186 永久性地为一件头部装备附加防御等级提高16、躲闪等级提高17的效果
 --沙塔尔
	--[3006] = 29195, --奥术防护秘药29195 永久性地为一件头部装备附加奥术抗性提高20点的效果
	[3002] = 29191, --强能秘药29191 永久性地为一件头部装备附加法术强度提高22点、法术命中等级提高14的效果
 --破碎残阳
	[3004] = 29193, --角斗士秘药29193 永久性地为一件头部装备附加耐力提高18点、韧性等级提高20的效果
 --紫罗兰之眼
	--[2998] = 29187, --耐久铭文29187 永久性地为一件肩部装备附加所有抗性提高7点的效果
 --荣耀堡+萨尔玛
	--[3007] = 29196, --火焰防护秘药LM 29196 永久性地为一件头部装备附加火焰抗性提高20点的效果
	--[3007] = 29197, --火焰防护秘药BL 29197永久性地为一件头部装备附加火焰抗性提高20点的效果
	[3001] = 29189, --恢复秘药LM 29189 永久性地为一件头部装备附魔，使其获得法术强度提高19点、每5秒恢复9点法力值的效果
	[3001] = 29190, --恢复秘药BL 29190 永久性地为一件头部装备附魔，使其获得法术强度提高19点、每5秒恢复9点法力值的效果
 --贫民窟
	--[3009] = 29199, --暗影防护秘药29199 永久性地为一件头部装备附加暗影抗性提高20点的效果
	[3096] = 30846, --流放者秘药30846 永久性地为一件头部装备附加力量提高17点、智力提高16点的效果

--=== WLK ===--
 --北风苔原先遣军
    [3842] = 44701, -- (Alliance联盟) 凶残角斗士秘药44701 肩部装备附加耐力提高30点、韧性等级提高25的效果
	[3842] = 44702, -- (Horde部落) 凶残角斗士秘药44702 肩部装备附加耐力提高30点、韧性等级提高25的效果
	[3842] = 50372, -- (Alliance联盟) 蛮荒斗士秘纹50372 肩部装备附加耐力提高30点、韧性等级提高25的效果
	[3842] = 50373, -- (Horde部落) 蛮荒斗士秘纹50373 肩部装备附加耐力提高30点、韧性等级提高25的效果
    [3849] = 44936, --spell=62201泰坦神铁护板 盾牌上加装泰坦神铁护板，使其格挡值提高81点，并使缴械效果的持续时间缩短50%
 --肯瑞托
	[3820] = 50368,	--玄秘燃烧秘纹  永久性地为一件头部装备附魔，使其获得法术强度提高30点、爆击等级提高20的效果
	--[3816] = 44141,	--烈焰之魂秘药 永久性地为一件头部装备附魔，使其获得火焰抗性提高25点、耐力值提高30点的效果
	[3820] = 44159,	--燃烧之谜秘药 永久性地为一件头部装备附魔，使其获得法术强度提高30点、爆击等级提高20的效果
 --银色北伐军
	[3818] = 50369,	--坚实保卫者秘纹50369 永久性地为一件头部装备附魔，使其获得耐力提高37点、防御等级提高20的效果
	[3818] = 44150, --坚定防御者秘药44150 永久性地为一件头部装备附魔，使其获得耐力提高37点、防御等级提高20的效果
	--[3814] = 44139,	--消散之影秘药 永久性地为一件头部装备附魔，使其获得暗影抗性提高25点、耐力值提高30点的效果
 --霍迪尔之子
	[3808] = 44133, --霍迪尔之子 强效利斧铭文 永久性地为一件肩部装备附加攻击强度提高40点、爆击等级提高15的效果	
	[3809] = 44134, --霍迪尔之子 强效峭壁铭文 永久性地为一件肩部装备附魔，使其获得法术强度提高24点、每5秒恢复8点法力值的效果
	[3810] = 44135, --霍迪尔之子 强效风暴铭文 永久性地为一件肩部装备附魔，使其获得法术强度提高24点、爆击等级提高15的效果
	[3811] = 44136, --霍迪尔之子 强效巅峰铭文 永久性地为一件肩部装备附加躲闪等级提高20、防御等级提高15的效果
	[3875] = 44131, --霍迪尔之子 次级利斧铭文 永久性地为一件肩部装备附加攻击强度提高30点、爆击等级提高10的效果
	[3807] = 44130, --霍迪尔之子 次级峭壁铭文 永久性地为一件肩部装备附魔，使其获得法术强度提高18点、每5秒恢复5点法力值的效果
	[3806] = 44129, --霍迪尔之子 次级风暴铭文 永久性地为一件肩部装备附魔，使其获得法术强度提高18点、爆击等级提高10的效果
	[3876] = 44132, --霍迪尔之子 次级巅峰铭文 永久性地为一件肩部装备附加躲闪等级提高15、防御等级提高10的效果
 --黑锋骑士团
	--[3813] = 44138,	--防毒秘药 永久性地为一件头部装备附魔，使其获得自然抗性提高25点、耐力值提高30点的效果
	[3817] = 50367,	--折磨秘纹 永久性地为一件头部装备附魔，使其获得攻击强度提高50点、爆击等级提高20的效果
 --龙眠联军
	--[3815] = 44140,	--月食秘药 永久性地为一件头部装备附魔，使其获得奥术抗性提高25点、耐力值提高30点的效果
	[3819] = 50370, --忘忧修补秘纹50370 永久性地为一件头部装备附魔，使其获得法术强度提高30点、每5秒恢复10点法力值的效果
    [3819] = 44152, --祝福治愈秘药44152 永久性地为一件头部装备附魔，使其获得法术强度提高30点、每5秒恢复10点法力值的效果
 --冬拥湖
    [3793] = 44067,	--凯旋铭文 永久性地为一件肩部装备附魔，使其获得攻击强度提高40点、韧性等级提高15的效果
	[3794] = 44068,	--统御铭文 永久性地为一件肩部装备附魔，使其获得法术强度提高23点、韧性等级提高15的效果
	[3795] = 44069,	--凯旋秘药 永久性地为一件头部装备附魔，使其获得攻击强度提高50点、韧性等级提高20的效果
    [3797] = 44075,	--统御秘药 永久性地为一件头部装备附魔，使其获得法术强度提高29点、韧性等级提高20的效果
 --PVP
    [3852] = 44957, --强效角斗士铭文 永久性地为一件肩部装备提供耐力提高30点、韧性等级提高15的效果
	
--=================== 商业技能附魔 ===================--
 --铭文
	[3835] = {GetSpellInfo(61117), 61117}, --大师的利斧铭文 永久性地为一件肩部装备附加攻击强度提高120点、爆击等级提高15的效果
	[3836] = {GetSpellInfo(61118), 61118}, --大师的峭壁铭文 永久性地为一件肩部装备附加法术强度提高70点、每5秒回复6点法力值的效果
	[3837] = {GetSpellInfo(61119), 61119}, --大师的巅峰铭文 永久性地为一件肩部装备附加躲闪等级提高60、防御等级提高15的效果
	[3838] = {GetSpellInfo(61120), 61120}, --大师的风暴铭文 永久性地为一件肩部装备附加法术强度提高70点、爆击等级提高15的效果
 --锻造
	[3731] = 41976, --泰坦神铁武器链41976 为你的武器附加一条武器链，使缴械效果的持续时间缩短50%，并使你的命中等级提高28
	[3748] = 42500, --泰坦神铁盾刺42500 在你的盾牌上加装一根泰坦神铁盾刺，每次使用这块盾牌格挡都会对攻击者造成45点伤害
	[3729] = 41611,	--spell=55655永恒腰带扣 永久性地在一条腰带上加装永恒腰带扣，为其增加一个宝石插槽
	[3723] = {GetSpellInfo(55641), 55641}, --插槽手套 永久性地为你的手套增加一个插槽
	[3717] = {GetSpellInfo(55628), 55628}, --插槽护腕 永久性地为你的护腕增加一个插槽
	[3720] = {GetSpellInfo(29720), 29720}, --强效护盾结界 在你的盾牌上附加一个强效护盾结界。这个结界在吸收4000点伤害之后失效
	[2714] = 23530, --spell=29454魔钢盾刺 在你的盾牌上加装一根魔钢盾刺，每次使用这块盾牌格挡都会对攻击者造成26到38点伤害
	[2791] = {GetSpellInfo(32282), 32282}, --强效结界符文 在胸甲或长袍上放置一个强效结界符文，有25%的几率在你每次被物理攻击命中时都为你恢复400点生命值，冷却时间90秒。持续1小时
	[2955] = 28421, --精金平衡石 钝器的伤害提高12点，爆击等级提高14，持续1小时。不能对等级高于165的物品使用
	[2713] = 23529, --精金磨刀石 锐器的伤害提高12点，爆击等级提高14，持续1小时。不能对等级高于165的物品使用
	[2719] = {GetSpellInfo(29507), 29507}, --次级护盾结界 在你的盾牌上附加一个次级护盾结界。这个结界在吸收1000点伤害之后失效
	[3223] = 33185, --精金武器链 为你的武器附加一条武器链，使缴械效果的持续时间缩短50%，你的招架等级提高15
	[2718] = {GetSpellInfo(32274), 32274}, --次级结界符文 在胸甲或长袍上放置一个次级结界符文，有25%的几率在你每次被物理攻击命中时都为你恢复200点生命值，冷却时间90秒。持续1小时
	[2506] = 18262, --元素磨刀石 使一件近战武器的爆击等级提高28，持续1小时。无法用于高于165级的物品
	[2954] = 28420, --魔能平衡石 钝器的伤害提高12点，持续1小时。不能对等级高于165的物品使用
	[2712] = 23528, --魔能磨刀石 锐器的伤害提高12点，持续1小时。不能对等级高于165的物品使用
	[1704] = 12645, --瑟银盾刺 在你的盾牌上加装一根瑟银盾刺，每次使用这块盾牌格挡都会对攻击者造成伤害
	[1703] = 12643, --致密平衡石 使钝器的武器伤害提高8点，持续1小时。不能对等级高于165的物品使用
	[1643] = 12404, --致密磨刀石 使锋利武器所造成的伤害提高8点，持续1小时。不能对等级高于165的物品使用
	[464] = 7969,	--秘银马刺 在你的靴子上加装马刺，使坐骑的移动速度提高4%。装备者等级必须低于70级才能获得这个效果
	[463] = 7967,	--秘银盾刺 在你的盾牌上加装一根秘银盾刺，每次使用这块盾牌格挡都会对攻击者造成伤害
	[484] = 7965,	--坚固的平衡石 使钝器的武器伤害提高6点，持续1小时。不能对等级高于165的物品使用
	[483] = 7964,	--坚固的磨刀石 使锋利武器所造成的伤害提高6点，持续1小时。不能对等级高于165的物品使用
	[37] = 6041,	--钢质武器链 为你的武器附加一条武器链，使缴械效果的持续时间缩短50%。不与其它同类效果叠加
	[34] = 6043,	--铁质平衡锤 在双手剑、双手斧或长柄武器上附加一块平衡锤，使其急速等级提高20
	[43] = 6042,	--铁质盾刺 在你的盾牌上加装一根铁质盾刺，每次使用这块盾牌格挡都会对攻击者造成伤害
	[21] = 3241,	--重平衡石 使钝器的武器伤害提高4点，持续1小时。不能对等级高于165的物品使用
	[14] = 2871,	--重磨刀石 使锋利武器所造成的伤害提高4点，持续1小时。不能对等级高于165的物品使用
	[20] = 3240,	--粗制平衡石 使钝器的武器伤害提高3点，持续1小时。不能对等级高于165的物品使用
	[13] = 2863,	--粗制磨刀石 使锋利武器所造成的伤害提高3点，持续1小时。不能对等级高于165的物品使用
	[19] = 3239,	--劣质平衡石 使钝器的武器伤害提高2点，持续1小时。不能对等级高于165的物品使用
	[40] = 2862,	--劣质磨刀石 使锋利武器所造成的伤害提高2点，持续1小时。不能对等级高于165的物品使用
 --制皮
	[3823] = 38374, --ID38374 spell=60582冰鳞腿甲片 永久性地在一件腿部装备上附加一块冰鳞腿甲片，使其获得攻击强度提高75点、爆击等级提高22的效果
	[3328] = 38374, --5.0取消这个了  蛛魔腿甲强化片(制皮师自己专用)  腿部装备上附加一块蛛魔腿甲强化片，使其获得攻击强度提高75点、爆击等级提高22的效果
	[3853] = 44963, --spell=62447土灵腿甲片 永久性地在一件腿部装备上附加土灵腿甲片，使其获得韧性等级提高40，耐力提高28点的效果
	[3822] = 38373, --spell=60581 霜皮腿甲片 永久性地在一件腿部装备上附加一块霜皮腿甲片，使其获得耐力提高55点、敏捷提高22点的效果
	--[3328] = {GetSpellInfo(50904), 50904},	--蛛魔腿甲强化片(制皮师自己专用)  永久性地在一件腿部装备上附加一块蛛魔腿甲强化片，使其获得攻击强度提高70点、爆击等级提高18的效果
	--原2012.9.25改5.0已取消[3328] = {GetSpellInfo(60584), 60584}, --蛛魔腿甲强化片(制皮师自己专用)  腿部装备上附加一块蛛魔腿甲强化片，使其获得攻击强度提高75点、爆击等级提高22的效果
	--[3327] = {GetSpellInfo(50903), 50903},	--冰虫腿甲强化片(制皮师自己专用)    永久性地在一件腿部装备上附加一块冰虫腿甲强化片，使其获得耐力提高50点、敏捷提高18点的效果
	[3327] = {GetSpellInfo(60583), 60583}, --冰虫腿甲强化片(制皮师自己专用)    耐力提高55点、敏捷提高22点
	[3326] = 38372, --spell=50902蛛魔腿甲片 腿部装备上附加一块蛛魔腿甲片，使其获得攻击强度提高55点、爆击等级提高15的效果
	[3325] = 38371, --spell=50901冰虫腿甲片 耐力提高45点、敏捷提高15点
	--[3760] = {GetSpellInfo(57694), 57694}, --毛皮衬垫 - 冰霜抗性 护腕附魔，使其获得冰霜抗性提高70点
	--[3763] = {GetSpellInfo(57701), 57701}, --毛皮衬垫 - 奥术抗性 护腕附魔，使其获得奥术抗性提高70点
	[3756] = {GetSpellInfo(57683), 57683}, --毛皮衬垫 - 攻击强度 护腕附魔，使其获得攻击强度提高130点
	--[3761] = {GetSpellInfo(57696), 57696}, --毛皮衬垫 - 暗影抗性 护腕附魔，使其获得暗影抗性提高70点
	[3758] = {GetSpellInfo(57691), 57691}, --毛皮衬垫 - 法术强度 护腕附魔，使其获得法术强度提高76点
	--[3759] = {GetSpellInfo(57692), 57692}, --毛皮衬垫 - 火焰抗性 护腕附魔，使其获得火焰抗性提高70点
	[3757] = {GetSpellInfo(57690), 57690}, --毛皮衬垫 - 耐力 护腕附魔，使其获得耐力提高102点
	--[3762] = {GetSpellInfo(57699), 57699}, --毛皮衬垫 - 自然抗性 护腕附魔，使其获得自然抗性提高70点
	[3330] = 38376, --厚北地护甲片 永久性地为一件头部、胸部、肩部、腿部、手或脚上的装备提供耐力提高18点的效果
	[3012] = 29535, --spell=35490虚空毒蛇腿甲片 腿部装备上附加一块虚空毒蛇腿甲片，使其获得攻击强度提高50点、爆击等级提高12的效果
	[3013] = 29536, --spell=35495虚空裂蹄腿甲片 腿部装备上附加一块虚空裂蹄腿甲片，使其获得耐力提高40点、敏捷提高12点的效果
	[3329] = 38375, --北地护甲片 永久性地为一件头部、胸部、肩部、腿部、手或脚上的装备提供耐力提高12点的效果
	[2841] = 34330, --厚重结缔皮护甲片 永久性地为一件头部、胸部、肩部、腿部、手或脚上的装备提供耐力提高10点的效果
	[3260] = 34207, --spell=44769手套强化护甲片 永久性地为一双手套提供护甲值提高240点的效果。该物品装备不得低于60级
	--[2987] = 29486, --冰霜护甲片 永久性地为一件穿戴在胸部、腿部、手部或脚上的装备提供额外的8点冰霜抗性
	--[2989] = 29488, --奥术护甲片 永久性地为一件穿戴在胸部、腿部、手部或脚上的装备提供额外的8点奥术抗性
	--[2984] = 29483, --暗影护甲片 永久性地为一件穿戴在胸部、腿部、手部或脚上的装备提供额外的8点暗影抗性
	--[2985] = 29485, --烈焰护甲片 永久性地为一件穿戴在胸部、腿部、手部或脚上的装备提供额外的8点火焰抗性
	--[2988] = 29487, --自然护甲片 永久性地为一件穿戴在胸部、腿部、手部或脚上的装备提供额外的8点自然抗性
	[3010] = 29533, --眼镜蛇皮腿甲片 永久性地在一件腿部装备上附加一块眼镜蛇皮腿甲片，使其获得攻击强度提高40点、爆击等级提高10的效果
	[3011] = 29534, --裂蹄腿甲片  永久性地在一件腿部装备上附加一块裂蹄腿甲片，使其获得耐力提高30点、敏捷提高10点的效果
	[2793] = 25651, --守备官的护甲片 永久性地为一件穿戴在胸部、腿部、手部或脚上的装备提供额外的8点防御等级
	[2794] = 25652, --魔导师的护甲片 永久性地为一件穿戴在胸部、腿部、手部或脚上的装备提供每5秒恢复4点法力值的效果
	[2503] = 18251, --熔火护甲片 永久性地使一件穿在胸部、腿、手或脚上的护甲的防御等级提高5
	[2792] = 25650, --结缔皮护甲片 永久性地为一件穿戴在胸部、腿部、手部或脚上的装备提供额外的8点耐力值
	[2795] = 25679, --鞋垫  放在一双鞋或靴子中，使你的脚更舒服
	[1843] = 15564, --毛皮护甲片 永久性地为一件穿戴在胸部、腿部、手部或脚上的装备提供额外的40点护甲值
	[18] = 8173,    --厚重护甲片 永久性地为一件穿戴在胸部、腿部、手部或脚上的装备提供额外的32点护甲值
	[17] = 4265,    --重型护甲片 永久性地为一件穿戴在胸部、腿部、手部或脚上的装备提供额外的24点护甲值
	[16] = 2313,    --中型护甲片 永久性地为一件穿戴在胸部、腿部、手部或脚上的装备提供额外的16点护甲值
	[15] = 2304,    --轻型护甲片 永久性地为一件穿戴在胸部、腿部、手部或脚上的装备提供额外的8点护甲值
	
 --裁缝
    [3721] = 41604, --天蓝魔线 永久性地在一件腿部装备上附加一条魔法丝线，使其获得法术强度提高50点、耐力值提高30点的效果
	--[3721] = 41606, --spell=55634OOXX 2012.9.25 发现重复的但英文名 天蓝魔线 永久性地在一件腿部装备上附加一条魔法丝线，使其获得法术强度提高50点、耐力值提高30点的效果
	[3719] = 41602, --spell=55631辉煌魔线 永久性地在一件腿部装备上附加一条魔法丝线，使其获得法术强度提高50点、精神值提高20点的效果
	--[3719] = 41605, --spell=55631OOXX 2012.9.25 发现重复的但英文名 永久性地在一件腿部装备上附加一条魔法丝线，使其获得法术强度提高50点、精神值提高20点的效果
	[3722] = {GetSpellInfo(55642), 55642}, --亮纹刺绣 在你的披风上刺绣魔法花纹，使你在施法时有一定几率获得法术强度提高295点的效果，持续15秒
	[3730] = {GetSpellInfo(55777), 55777}, --剑刃刺绣 在你的披风上刺绣魔法花纹，使你的伤害性近战和远程攻击有时可以令你的攻击强度提高400点，持续15秒
	[3728] = {GetSpellInfo(55769), 55769}, --黑光刺绣 在你的披风上刺绣魔法花纹，使你在施法时有一定几率恢复400点法力值
	[3873] = {GetSpellInfo(56034), 56034}, --大师的魔线 永久性地在一件腿部装备上附加一条魔法丝线，使其获得法术强度提高50点、耐力值提高30点的效果
	[3872] = {GetSpellInfo(56039), 56039}, --神圣魔线 永久性地在一件腿部装备上附加一条魔法丝线，使其获得法术强度提高50点、精神值提高20点的效果
	[3720] = 41603, --spell=55632碧蓝魔线 永久性地在一件腿部装备上附加一条魔法丝线，使其获得法术强度提高35点、耐力值提高20点的效果
	[3718] = 41601, --spell=55630闪光魔线 永久性地在一件腿部装备上附加一条魔法丝线，使其获得法术强度提高35点、精神值提高12点的效果
    [2748] = 24274, --spell=31372符文魔线 永久性地在一件腿部装备上附加一条魔法丝线，使其获得法术强度提高35点、耐力值提高20点的效果
	[2746] = 24276, --spell=31370金色魔线 永久性地在一件腿部装备上附加一条魔法丝线，使其获得法术强度提高35点、耐力值提高20点的效果
	[2747] = 24273, --秘法魔线 永久性地在一件腿部装备上附加一条魔法丝线，使其获得法术强度提高25点、耐力值提高15点的效果
	[2745] = 24275, --银色魔线 永久性地在一件腿部装备上附加一条魔法丝线，使其获得法术强度提高25点、耐力值提高15点的效果
 --工程学
	[3878] = {GetSpellInfo(67839), 67839}, --思维放大圆盘 拆开头盔并加装上一个思维放大圆盘，使你的耐力提高45点，并使你可以使用意念同一名敌人战斗，很有可能控制他们。每10分钟可以使用一次
	[3606] = {GetSpellInfo(55016), 55016}, --硝化甘油推进器 永久性地为一双靴子附加硝化甘油推进器，使你的爆击等级提高24，并且可以通过启动推进器极大地提高奔跑速度，持续5秒
	[3603] = {GetSpellInfo(54998), 54998}, --41091手部火箭发射器 永久性地在你的手套上加装一副手部火箭发射器，经验丰富的技师可以使用它对远处的敌人造成1654点火焰伤害。每45秒只能发射一次
	[3860] = {GetSpellInfo(63770), 63770}, --装甲护网 永久性地在板甲手套上附加一层装甲护网，使护甲值提高885点
	[3604] = {GetSpellInfo(54999), 54999}, --41093  ==2012.9.25查看是物品，不是附魔  超级加速器 永久性地为一双手套附加超级加速器，资深的工程学技师可以通过启动加速器获得急速等级提高340的效果，持续12秒。手套每分钟只能启动一次
	[3599] = {GetSpellInfo(54736), 54736}, --40776单兵电磁脉冲发生器 永久性地在你的腰带上加装单兵电磁脉冲发生器，使你可以扰乱附近的机械单位，令它们变得混乱。只有经验丰富的技师可以使用改造过的腰带
	[3859] = {GetSpellInfo(63765), 63765}, --弹力蛛丝 永久性地在一件披风中加入弹性蛛丝，使你的法术强度提高27点，并且可以将披风变成降落伞，减缓坠落速度，持续30秒
	[3601] = {GetSpellInfo(54793), 54793}, --弹带 在你的腰带上加装一副微型炸药装置，使你每6分钟就可以取出并投掷一颗钴质破片炸弹
	[3605] = {GetSpellInfo(55002), 55002}, --41111高弹力衬垫 永久性地在一件披风中加入高弹力衬垫，使你的敏捷值提高23点，并且可以将披风变成降落伞，减缓坠落速度，持续30秒
	[3608] = 41167, --觅心瞄准镜41167 在弓或枪械上加装永久性的瞄准镜，使其远程爆击等级提高40
	[3607] = 41146, --太阳瞄准镜41146 在弓或枪上加装永久性的瞄准镜，使其急速等级提高40
	[2724] = 23766, --稳定恒金瞄准镜23766 在弓或枪械上加装永久性的瞄准镜，使其爆击等级提高28
	[2723] = 23765, --氪金瞄准镜23765 在弓或枪械上加装永久性的瞄准镜，使其攻击伤害提高12点
	[2523] = 18283, --比兹尼克247x128精确瞄准镜18283 在弓或枪械上加装永久性的瞄准镜，使其命中等级提高30
	[2722] = 23764, --精金瞄准镜23764 在弓或枪械上加装永久性的瞄准镜，使其攻击伤害提高10点
	[33] = 4407,     --精确瞄准镜4407 在弓或枪械上加装永久性的瞄准镜，使其攻击伤害提高3点
	[3843] = 44739, --钻石折射瞄准镜44739 在弓或枪械上加装永久性的瞄准镜，使其伤害提高15
	[664] = 10548,  --狙击瞄准镜10548 在弓或枪械上加装永久性的瞄准镜，使其攻击伤害提高7点
	[663] = 10546,  --致命瞄准镜10546 在弓或枪械上加装永久性的瞄准镜，使其攻击伤害提高5点
	[32] = 4406,     --普通瞄准镜4406 在弓或枪械上加装永久性的瞄准镜，使其攻击伤害提高2点
	[30] = 4405,     --粗制瞄准镜4405 在弓或枪械上加装永久性的瞄准镜，使其攻击伤害提高1点
 

--=================== 附魔 ===================--
--1-75
    [243] = {GetSpellInfo(7766), 7766}, --附魔护腕 - 初级精神  精神+1
    [242] = {GetSpellInfo(7748), 7748}, --附魔胸甲 - 次级生命  生命值+15	
	[66] = {GetSpellInfo(7457), 7457},  --附魔护腕 - 初级耐力 耐力+1
	--[65] = {GetSpellInfo(7454), 7454},  --附魔披风 - 初级抗性 所有魔法抗性+1
	[44] = {GetSpellInfo(7426), 7426},  --附魔胸甲 - 初级吸收  被击中时都有2%的机会吸收10点伤害
	[24] = {GetSpellInfo(7443), 7443},  --附魔胸甲 - 初级法力 法力值+5	
	[41] = {GetSpellInfo(7420), 7420},  --附魔胸甲 - 初级生命 生命值+5
	[924] = {GetSpellInfo(7428), 7428}, --附魔护腕 - 初级偏斜  防御等级+2	
	[41] = {GetSpellInfo(7418), 7418},  --附魔护腕 - 初级生命 生命值+5
--76-150
	[723] = {GetSpellInfo(13622), 13622},  --附魔护腕 - 次级智力 智力+3
	[847] = {GetSpellInfo(13626), 13626},  --附魔胸甲 - 初级属性 属性+1
	[943] = {GetSpellInfo(13529), 13529},  --附魔双手武器 - 次级冲击 永久性地为一把双手近战武器附魔，使其获得伤害提高3点的效果
	[845] = {GetSpellInfo(13617), 13617},  --附魔手套 - 草药学 草药学技能+2
	[844] = {GetSpellInfo(13612), 13612},  --附魔手套 - 采矿 采矿技能+2
	--原2012.9.25改[846] = {GetSpellInfo(13620), 13620},  --附魔手套 - 钓鱼 钓鱼技能+2
	[2603] = {GetSpellInfo(13620), 13620},  --附魔手套 - 钓鱼 钓鱼技能+2
	[843] = {GetSpellInfo(13607), 13607},  --附魔胸甲 - 法力 法力值+30	
	[823] = {GetSpellInfo(13536), 13536},  --附魔护腕 - 次级力量 力量+3
	[241] = {GetSpellInfo(13503), 13503},  --附魔武器 - 次级攻击 近战武器附魔，使其获得伤害提高2点
	[63] = {GetSpellInfo(13538), 13538},   --附魔胸甲 - 次级吸收 每次被击中时都有5%的机会吸收25点伤害
	--[804] = {GetSpellInfo(13522), 13522},  --附魔披风 - 次级暗影抵抗 暗影抗性+10
	[724] = {GetSpellInfo(13501), 13501},  --附魔护腕 - 次级耐力 耐力+3
	[255] = {GetSpellInfo(13485), 13485},  --附魔盾牌 - 次级精神 精神+3
	--[256] = {GetSpellInfo(7861), 7861},    --附魔披风 - 次级火焰抗性 火焰抗性+5
	[247] = {GetSpellInfo(7867), 7867},    --附魔靴子 - 初级敏捷 敏捷+1
	[66] = {GetSpellInfo(7863), 7863},     --附魔靴子 - 初级耐力 耐力+1
	[255] = {GetSpellInfo(7859), 7859},    --附魔护腕 - 次级精神 精神+3
	[254] = {GetSpellInfo(7857), 7857},    --附魔胸甲 - 生命 生命值+25
	[744] = {GetSpellInfo(13421), 13421},  --附魔披风 - 次级防护 护甲+20
	[848] = {GetSpellInfo(13464), 13464},  --附魔盾牌 - 次级防护 永久性地为一面盾牌附魔，使其获得护甲值+30的效果
	[255] = {GetSpellInfo(13380), 13380},  --附魔双手武器 - 次级精神 双手近战武器附魔，使其获得精神+3
	[247] = {GetSpellInfo(13419), 13419},  --附魔披风 - 初级敏捷 敏捷+1
	[66] = {GetSpellInfo(13378), 13378},   --附魔盾牌 - 初级耐力 耐力+1
	[241] = {GetSpellInfo(7745), 7745},    --附魔双手武器 - 初级冲击 双手近战武器附魔，使其获得伤害提高2点
	[723] = {GetSpellInfo(7793), 7793},    --附魔双手武器 - 次级智力 双手近战武器附魔，使其获得智力+3
	[783] = {GetSpellInfo(7771), 7771},    --附魔披风 - 初级防护 护甲+10
	[249] = {GetSpellInfo(7786), 7786},    --附魔武器 - 初级屠兽 野兽伤害提高2点	
	[250] = {GetSpellInfo(7788), 7788},    --附魔武器 - 初级攻击 伤害提高1点	
	[248] = {GetSpellInfo(7782), 7782},    --附魔护腕 - 初级力量 力量+1
	[247] = {GetSpellInfo(7779), 7779},    --附魔护腕 - 初级敏捷 敏捷+1
	[246] = {GetSpellInfo(7776), 7776},    --附魔胸甲 - 次级法力 法力值+20
--151-225
	[856] = {GetSpellInfo(13887), 13887},   --附魔手套 - 力量 力量+5
	[909] = {GetSpellInfo(13868), 13868},   --附魔手套 - 高级草药学 草药学技能+5
	[849] = {GetSpellInfo(13882), 13882},	--附魔披风 - 次级敏捷 敏捷+3
	[911] = {GetSpellInfo(13890), 13890},	--附魔靴子 - 初级速度 略微提升移动速度
	[3858] = {GetSpellInfo(63746), 63746},	--附魔靴子 - 次级精确 命中等级+5
	[907] = {GetSpellInfo(13846), 13846},	--附魔护腕 - 强效精神 精神+7
	[908] = {GetSpellInfo(13858), 13858},	--附魔胸甲 - 超强生命 生命值+50
	[906] = {GetSpellInfo(13841), 13841},	--附魔手套 - 高级采矿 采矿技能+5
	[852] = {GetSpellInfo(13836), 13836},	--附魔靴子 - 耐力 耐力+5
	[904] = {GetSpellInfo(13815), 13815},	--附魔手套 - 敏捷 敏捷+5
	[905] = {GetSpellInfo(13822), 13822},	--附魔护腕 - 智力 智力+5
	[852] = {GetSpellInfo(13817), 13817},	--附魔盾牌 - 耐力 耐力+5
	[884] = {GetSpellInfo(13746), 13746},	--附魔披风 - 强效防御 护甲+50
	--[903] = {GetSpellInfo(13794), 13794},	--附魔披风 - 抗性 所有魔法抗性+3
	[1897] = {GetSpellInfo(13695), 13695},	--附魔双手武器 - 冲击 双手近战武器附魔，使其获得伤害提高5点
	[865] = {GetSpellInfo(13698), 13698},	--附魔手套 - 剥皮 剥皮技能+5
	[866] = {GetSpellInfo(13700), 13700},	--附魔胸甲 - 次级状态 所有属性+2
	[943] = {GetSpellInfo(13693), 13693},	--附魔武器 - 攻击 伤害提高3点
	[863] = {GetSpellInfo(13689), 13689},	--附魔盾牌 - 次级格挡 格挡等级+10
	[2443] = {GetSpellInfo(21931), 21931},	--附魔武器 - 寒冬之力 冰霜法术强度提高7点
	[255] = {GetSpellInfo(13687), 13687},	--附魔靴子 - 次级精神 精神+3
	[857] = {GetSpellInfo(13663), 13663},	--附魔胸甲 - 强效法力 法力值+50
	[856] = {GetSpellInfo(13661), 13661},	--附魔护腕 - 力量 力量+5
	[851] = {GetSpellInfo(13659), 13659},	--附魔盾牌 - 精神 精神+5
	--[2463] = {GetSpellInfo(13657), 13657},	--附魔披风 - 火焰抗性 火焰抗性+7
	[854] = {GetSpellInfo(13655), 13655},	--附魔武器 - 次级元素杀手 对元素生物伤害提高6点
	[853] = {GetSpellInfo(13653), 13653},	--附魔武器 - 次级屠兽 对野兽伤害提高6点
	[925] = {GetSpellInfo(13646), 13646},	--附魔护腕 - 次级偏斜 防御等级+3
	[852] = {GetSpellInfo(13648), 13648},	--附魔护腕 - 耐力 耐力+5
	[724] = {GetSpellInfo(13644), 13644},	--附魔靴子 - 次级耐力 耐力+3
	[851] = {GetSpellInfo(13642), 13642},	--附魔护腕 - 精神 精神+5
	[850] = {GetSpellInfo(13640), 13640},	--附魔胸甲 - 强效生命 生命值+35
	[849] = {GetSpellInfo(13637), 13637},	--附魔靴子 - 次级敏捷 敏捷+3
	[848] = {GetSpellInfo(13635), 13635},	--附魔披风 - 防御 护甲+30
	[724] = {GetSpellInfo(13631), 13631},	--附魔盾牌 - 次级耐力 耐力+3
--226-300
	[1593] = {GetSpellInfo(34002), 34002},	--附魔护腕 - 突袭 攻击强度提高24点
	[3150] = {GetSpellInfo(33991), 33991},	--附魔胸甲 - 优秀法力回复 每5秒回复7点法力值
	[1904] = {GetSpellInfo(20036), 20036},	--附魔双手武器 - 特效智力 智力提高9点
	[1903] = {GetSpellInfo(20035), 20035},	--附魔双手武器 - 特效精神 精神提高9点
	[2615] = {GetSpellInfo(25074), 25074},	--附魔手套 - 冰霜能量 冰霜法术强度提高20点
	[2613] = {GetSpellInfo(25072), 25072},	--附魔手套 - 威胁 威胁值提高2%
	[2614] = {GetSpellInfo(25073), 25073},	--附魔手套 - 暗影能量 暗影法术强度提高20点
	[2617] = {GetSpellInfo(25079), 25079},	--附魔手套 - 治疗能量 法术强度提高16点
	[2616] = {GetSpellInfo(25078), 25078},	--附魔手套 - 火焰能量 火焰法术强度提高20点
	[2564] = {GetSpellInfo(25080), 25080},	--附魔手套 - 超强敏捷 敏捷提高15点
	[2650] = {GetSpellInfo(23802), 23802},	--附魔护腕 - 治疗能力 法术强度提高15点
	[1886] = {GetSpellInfo(20011), 20011},	--附魔护腕 - 超强耐力 耐力+9
	--[2619] = {GetSpellInfo(25081), 25081},	--附魔披风 - 强效火焰抗性 火焰抗性+15
	--[2620] = {GetSpellInfo(25082), 25082},	--附魔披风 - 强效自然抗性 自然抗性+15
	[910] = {GetSpellInfo(25083), 25083},	--附魔披风 - 潜行 潜行能力提高
	[2621] = {GetSpellInfo(25084), 25084},	--附魔披风 - 狡诈 威胁值降低2%
	[2622] = {GetSpellInfo(25086), 25086},	--附魔披风 - 躲闪 躲闪等级+12
	[1900] = {GetSpellInfo(20034), 20034},	--附魔武器 - 十字军 近战攻击命中目标时经常获得神圣之力，为装备者恢复75到125点生命值，并使其力量提高100点，持续15秒
	[2568] = {GetSpellInfo(23804), 23804},	--附魔武器 - 强效智力 智力提高22点
	[2567] = {GetSpellInfo(23803), 23803},	--附魔武器 - 强效精神 精神提高20点
	[2505] = {GetSpellInfo(22750), 22750},	--附魔武器 - 治疗能量 法术强度提高29点
	[2504] = {GetSpellInfo(22749), 22749},	--附魔武器 - 法术能量 法术强度提高30点
	[1898] = {GetSpellInfo(20032), 20032},	--附魔武器 - 生命吸取 从敌人那儿吸取生命值
	[1897] = {GetSpellInfo(20031), 20031},	--附魔武器 - 超强打击 伤害提高5点
	[1891] = {GetSpellInfo(20025), 20025},	--附魔胸甲 - 强效属性 所有属性提高4点
	[1896] = {GetSpellInfo(20030), 20030},	--附魔双手武器 - 超强冲击 伤害+9
	[927] = {GetSpellInfo(20013), 20013},	--附魔手套 - 强效力量 力量+7
	[1885] = {GetSpellInfo(20010), 20010},	--附魔护腕 - 超强力量 力量+9
	[1899] = {GetSpellInfo(20033), 20033},	--附魔武器 - 邪恶武器 诅咒目标，减少目标造成的近战伤害
	[1887] = {GetSpellInfo(20023), 20023},	--附魔靴子 - 强效敏捷 敏捷+7
	[2646] = {GetSpellInfo(27837), 27837},	--附魔双手武器 - 敏捷 敏捷提高25点
	[2565] = {GetSpellInfo(23801), 23801},	--附魔护腕 - 法力回复 每5秒回复5点法力值 
	[2563] = {GetSpellInfo(23799), 23799},	--附魔武器 - 力量 力量提高15点
	[2564] = {GetSpellInfo(23800), 23800},	--附魔武器 - 敏捷 敏捷提高15点
	[1893] = {GetSpellInfo(20028), 20028},	--附魔胸甲 - 特效法力 法力值+100
	[1889] = {GetSpellInfo(20015), 20015},	--附魔披风 - 超强防御 护甲值+70
	[1894] = {GetSpellInfo(20029), 20029},	--附魔武器 - 冰寒 可以释放冰寒，使目标的移动和攻击速度减慢。对60级以上玩家的效果降低
	[1890] = {GetSpellInfo(20016), 20016},	--附魔盾牌 - 活力 每5秒回复4点法力值和生命值
	[1892] = {GetSpellInfo(20026), 20026},	--附魔胸甲 - 特效生命 生命值+100
	[851] = {GetSpellInfo(20024), 20024},	--附魔靴子 - 精神 精神+5
	[1887] = {GetSpellInfo(20012), 20012},	--附魔手套 - 强效敏捷 敏捷+7
	[1884] = {GetSpellInfo(20009), 20009},	--附魔护腕 - 超强精神 精神+9
	--[1888] = {GetSpellInfo(20014), 20014},	--附魔披风 - 强效抗性 所有抗性+5
	[803] = {GetSpellInfo(13898), 13898},	--附魔武器 - 烈焰 在命中目标时经常附加40点火焰伤害
	[929] = {GetSpellInfo(20017), 20017},	--附魔盾牌 - 强效耐力 永久性地为一面盾牌附魔，使其获得耐力+7的效果。
	[929] = {GetSpellInfo(20020), 20020},	--附魔靴子 - 强效耐力 永久性地为一双靴子附魔，使其获得耐力+7的效果
	[1883] = {GetSpellInfo(20008), 20008},	--附魔护腕 - 强效智力 永久性地为一副护腕附魔，使其获得智力+7的效果
	[931] = {GetSpellInfo(13948), 13948},	--附魔手套 - 初级加速 永久性地为一双手套附魔，使其获得急速等级提高10的效果
	[930] = {GetSpellInfo(13947), 13947},	--附魔手套 - 骑乘 永久性地为一双手套附魔， 使它们获得坐骑移动速度提高2%的效果。装备者的等级必须不高于70级才能获得这个效果
	[929] = {GetSpellInfo(13945), 13945},	--附魔护腕 - 强效耐力 永久性地为一副护腕附魔，使其获得耐力+7的效果
	[805] = {GetSpellInfo(13943), 13943},	--附魔武器 - 强效攻击 永久性地为一把近战武器附魔，使其获得伤害提高4点的效果
	[928] = {GetSpellInfo(13941), 13941},	--附魔胸甲 - 状态 永久性地为一件胸甲附魔，使它获得所有属性+3的效果
	[963] = {GetSpellInfo(13937), 13937},	--附魔双手武器 - 强效冲击 永久性地为一把双手近战武器附魔，使其获得伤害提高7点的效果
	[927] = {GetSpellInfo(13939), 13939},	--附魔护腕 - 强效力量 永久性地为一副护腕附魔，使它们获得力量+7的效果
	[923] = {GetSpellInfo(13931), 13931},	--附魔护腕 - 偏斜 永久性地为一副护腕附魔，使其获得防御等级+5的效果
	--[926] = {GetSpellInfo(13933), 13933},	--附魔盾牌 - 冰霜抗性 永久性地为一面盾牌附魔，使其获得冰霜抗性+8的效果
	[904] = {GetSpellInfo(13935), 13935},	--附魔靴子 - 敏捷 永久性地为一双靴子附魔，使它们获得敏捷+5的效果
	[912] = {GetSpellInfo(13915), 13915},	--附魔武器 - 屠魔 永久性地为一把近战武器附魔，使其有一定几率击晕恶魔并对其造成额外伤害
	[907] = {GetSpellInfo(13905), 13905},	--附魔盾牌 - 强效精神 永久性地为一面盾牌附魔，使它获得精神+7的效果
	[913] = {GetSpellInfo(13917), 13917},	--附魔胸甲 - 超强法力 永久性地为一件胸甲附魔，使它获得法力值+65的效果

	--301-375
	[1119] = {GetSpellInfo(44555), 44555},	--附魔护腕 - 优异智力 智力提高16点
	[3225] = {GetSpellInfo(42974), 42974},	--附魔武器 - 斩杀 有一定几率获得护甲穿透等级提高120的效果
	[3824] = {GetSpellInfo(60606), 60606},	--附魔靴子 - 突袭 攻击强度提高24点
	[2931] = {GetSpellInfo(27927), 27927},	--附魔戒指 - 属性 所有属性+4
	[2648] = {GetSpellInfo(47051), 47051},	--附魔披风 - 钢纹 防御等级+12
	[2673] = {GetSpellInfo(27984), 27984},	--附魔武器 - 猫鼬 有一定几率令你的敏捷提高120点，攻击速度略微提升 
	[2672] = {GetSpellInfo(27982), 27982},	--附魔武器 - 魂霜 冰霜和暗影法术强度提高54点
	[3252] = {GetSpellInfo(44623), 44623},	--附魔胸甲 - 超级属性 所有属性提高8点
	[2930] = {GetSpellInfo(27926), 27926},	--附魔戒指 - 治疗能量 法术强度+12
	[2658] = {GetSpellInfo(27954), 27954},	--附魔长靴 - 稳固 爆击等级和命中等级提高10
	[3246] = {GetSpellInfo(44592), 44592},	--附魔手套 - 优异法术强度 法术强度提高28点 
	[1600] = {GetSpellInfo(60616), 60616},	--附魔护腕 - 打击 攻击强度提高38点
	[2670] = {GetSpellInfo(27977), 27977},	--附魔双手武器 - 特效敏捷 敏捷提高35点
	[2929] = {GetSpellInfo(27920), 27920},	--附魔戒指 - 打击 物理伤害+2
	[2937] = {GetSpellInfo(33997), 33997},	--附魔手套 - 特效法术能量 法术强度提高20点
	[2935] = {GetSpellInfo(33994), 33994},	--附魔手套 - 精确打击 命中等级提高15
	[2650] = {GetSpellInfo(27917), 27917},	--附魔护腕 - 法术能量 法术强度提高15点
	[2675] = {GetSpellInfo(28004), 28004},	--附魔武器 - 作战专家 有一定几率在命中目标后为附近的小队成员恢复180到300点生命值的效果
	[2674] = {GetSpellInfo(28003), 28003},	--附魔武器 - 魔法激荡 在施法时有一定几率为附近的小队成员恢复100点法力值的效果
	--[1888] = {GetSpellInfo(27947), 27947},	--附魔盾牌 - 抗性 所有魔法抗性+5
	[1951] = {GetSpellInfo(46594), 46594},	--附魔胸甲 - 防御 防御等级提高16
	[2939] = {GetSpellInfo(34007), 34007},	--附魔长靴 - 豹之迅捷 移动速度略微提升以及敏捷提高6点
	[2940] = {GetSpellInfo(34008), 34008},	--附魔长靴 - 野猪之速 移动速度略微提升以及耐力提高9点 
	[2928] = {GetSpellInfo(27924), 27924},	--附魔戒指 - 法术能量 法术强度+12
	[3825] = {GetSpellInfo(60609), 60609},	--附魔披风 - 速度 急速等级提高15
	[3233] = {GetSpellInfo(27958), 27958},	--附魔胸甲 - 优异法力 法力值提高250点
	[2667] = {GetSpellInfo(27971), 27971},	--附魔双手武器 - 野蛮 攻击强度提高70点
	[2322] = {GetSpellInfo(33999), 33999},	--附魔手套 - 特效治疗 法术强度提高19点
	[2649] = {GetSpellInfo(27914), 27914},	--附魔护腕 - 坚韧 耐力提高+12
	--[1257] = {GetSpellInfo(34005), 34005},	--附魔披风 - 强效奥术抗性 奥术抗性+15
	--[1441] = {GetSpellInfo(34006), 34006},	--附魔披风 - 强效暗影抗性 暗影抗性+15 
	[3222] = {GetSpellInfo(42620), 42620},	--附魔武器 - 强效敏捷 敏捷提高20点
	[2668] = {GetSpellInfo(27972), 27972},	--附魔武器 - 潜能 力量提高20点
	[3846] = {GetSpellInfo(34010), 34010},	--附魔武器 - 特效治疗 法术强度提高40点
	[2669] = {GetSpellInfo(27975), 27975},	--附魔武器 - 特效法术能量 法术强度提高40点
	[2661] = {GetSpellInfo(27960), 27960},	--附魔胸甲 - 优异属性 所有属性提高6点
	[2933] = {GetSpellInfo(33992), 33992},	--附魔胸甲 - 特效韧性 韧性等级提高15
	[684] = {GetSpellInfo(33995), 33995},	--附魔手套 - 特效力量 力量提高15点
	[963] = {GetSpellInfo(27967), 27967},	--附魔武器 - 特效打击 伤害提高7点
	[2666] = {GetSpellInfo(27968), 27968},	--附魔武器 - 特效智力 智力提高30点
	[2655] = {GetSpellInfo(27946), 27946},	--附魔盾牌 - 盾牌格挡 格挡等级+15
	[2657] = {GetSpellInfo(27951), 27951},	--附魔长靴 - 灵巧 敏捷提高12点
	[2679] = {GetSpellInfo(27913), 27913},	--附魔护腕 - 优秀法力回复 每5秒回复8点法力值
	--[2664] = {GetSpellInfo(27962), 27962},	--附魔披风 - 特效抗性 所有抗性+7
	[3229] = {GetSpellInfo(44383), 44383},	--附魔盾牌 - 韧性 韧性等级提高12
	[2650] = {GetSpellInfo(27911), 27911},	--附魔护腕 - 超强治疗 法术强度提高15点
	[2938] = {GetSpellInfo(34003), 34003},	--附魔披风 - 法术穿透 法术穿透+20
	[2654] = {GetSpellInfo(27945), 27945},	--附魔盾牌 - 智力 智力+12
	[1071] = {GetSpellInfo(34009), 34009},	--附魔盾牌 - 特效耐力 永久性地为一面盾牌附魔，使其获得耐力+18的效果。该装备等级不得低于35级
	[2648] = {GetSpellInfo(27906), 27906},	--附魔护腕 - 特效防御 永久性地为一副护腕附魔，使其获得防御等级+12的效果。该装备等级不得低于35级
	[1144] = {GetSpellInfo(33990), 33990},	--附魔胸甲 - 特效精神 永久性地为一件胸甲附魔，使它获得精神提高15点的效果。该装备等级不得低于35级
	[2649] = {GetSpellInfo(27950), 27950},	--附魔长靴 - 坚韧 永久性地为一双靴子附魔，使其获得耐力提高12点的效果。该装备的物品等级不得低于35级
	[1891] = {GetSpellInfo(27905), 27905},	--附魔护腕 - 属性 永久性地为一副护腕附魔，使它们获得所有属性提高4点的效果。该装备等级不得低于35级
	[2659] = {GetSpellInfo(27957), 27957},	--附魔胸甲 - 优异生命 永久性地为一件胸甲附魔，使它获得生命值提高150点的效果。该装备等级不得低于35级
	[1594] = {GetSpellInfo(33996), 33996},	--附魔手套 - 突袭 永久性地为一双手套附魔，使它们获得攻击强度提高26点的效果。该装备等级不得低于35级
	[368] = {GetSpellInfo(34004), 34004},	--附魔披风 - 强效敏捷 永久性地为一件披风附魔，使它获得敏捷提高12点的效果。该装备等级不得低于35级
	[2662] = {GetSpellInfo(27961), 27961},	--附魔披风 - 特效护甲 永久性地为一件披风附魔，使它获得护甲值提高120点的效果。该装备等级不得低于35级
	[2653] = {GetSpellInfo(27944), 27944},	--附魔盾牌 - 坚韧盾牌 永久性地为一面盾牌附魔，使它获得格挡值提高36点的效果。该装备等级不得低于35级
	[2934] = {GetSpellInfo(33993), 33993},	--附魔手套 - 冲击 永久性地为一双手套附魔，使其获得爆击等级提高10的效果。该装备等级不得低于35级
	[2647] = {GetSpellInfo(27899), 27899},	--附魔护腕 - 强壮 永久性地为一副护腕附魔，使它们获得力量提高12点的效果。该装备等级不得低于35级
	[369] = {GetSpellInfo(34001), 34001},	--附魔护腕 - 特效智力 永久性地为一副护腕附魔，使它们获得智力提高12点的效果。该装备等级不得低于35级
	[2656] = {GetSpellInfo(27948), 27948},	--附魔长靴 - 活力 永久性地为一双靴子附魔，使它们获得每5秒回复5点生命值和法力值的效果。该装备等级不得低于35级
	[3273] = {GetSpellInfo(46578), 46578},	--附魔武器 - 死亡霜冻 永久性地为一把近战武器附魔，使你的伤害性法术和近战武器攻击有一定几率对目标造成额外的冰霜伤害，并使其近战、远程和施法速度降低。该装备等级不得低于60级
    [2671] = {GetSpellInfo(27981), 27981},  --附魔武器 - 阳炎 永久性地为一把近战武器附魔，使其获得奥术和火焰法术强度提高50点的效果。该装备等级不得低于35级
--376-450
	[3850] = {GetSpellInfo(62256), 62256},	--附魔护腕 - 特效耐力 耐力+40
	[3851] = {GetSpellInfo(62257), 62257},	--附魔武器 - 泰坦护卫 耐力+50
	[3854] = {GetSpellInfo(62948), 62948},	--附魔法杖 - 强效法术能量 法术强度提高81点
	[3869] = {GetSpellInfo(64441), 64441},	--附魔武器 - 利刃防护 利刃防护效果可以使你的招架等级提高200，并在下一次招架时造成600到800点伤害，效果持续10秒
	[3870] = {GetSpellInfo(64579), 64579},	--附魔武器 - 吸血 在攻击敌人或受到流血伤害时，它有可能触发储备血浆效果。当你的生命值低于35%时，储备血浆可以为你恢复360点生命值。持续20秒，可以叠加最多5次
	[2332] = {GetSpellInfo(60767), 60767},	--附魔护腕 - 超强法术能量 法术强度提高30点
	[3296] = {GetSpellInfo(47899), 47899},	--附魔披风 - 智慧 威胁值略微降低、精神提高10点
	[3256] = {GetSpellInfo(44631), 44631},	--附魔披风 - 暗影护甲 潜行等级略微提高、敏捷提高10点
	[3789] = {GetSpellInfo(59621), 59621},	--附魔武器 - 狂暴 有时令你的攻击强度提高400点、但是护甲值降低的效果
	[3788] = {GetSpellInfo(59619), 59619},	--附魔武器 - 精确 爆击等级和命中等级提高25
	[3790] = {GetSpellInfo(59625), 59625},	--附魔武器 - 黑魔法 使你的伤害法术有时可以附加可怕的诅咒
	[3832] = {GetSpellInfo(60692), 60692},	--附魔胸甲 - 强力属性 所有属性提高10点
	[1597] = {GetSpellInfo(60763), 60763},	--附魔靴子 - 强效突袭 攻击强度提高32点
	[3232] = {GetSpellInfo(47901), 47901},	--附魔靴子 - 海象人的活力 耐力提高15点、移动速度略微提高
	[3253] = {GetSpellInfo(44625), 44625},	--附魔手套 - 士兵 威胁值提高2%、招架等级提高10
	[1951] = {GetSpellInfo(44591), 44591},	--附魔披风 - 泰坦之纹 防御等级提高16
	[3834] = {GetSpellInfo(60714), 60714},	--附魔武器 - 极效法术能量 法术强度提高63点
	[3833] = {GetSpellInfo(60707), 60707},	--附魔武器 - 超强潜能 攻击强度提高65点
	[3247] = {GetSpellInfo(44595), 44595},	--附魔双手武器 - 天灾斩除 对亡灵的攻击强度提高140点
	[3827] = {GetSpellInfo(60691), 60691},	--附魔双手武器 - 杀戮 攻击强度提高110点
	[3845] = {GetSpellInfo(44575), 44575},	--附魔护腕 - 强效突袭 攻击强度提高50点
	[3831] = {GetSpellInfo(47898), 47898},	--附魔披风 - 强效速度 急速等级提高23
	[3294] = {GetSpellInfo(47672), 47672},	--附魔披风 - 极效护甲 护甲值提高225点
	[3251] = {GetSpellInfo(44621), 44621},	--附魔武器 - 巨人杀手 有一定几率降低目标移动速度、以及对巨人造成额外伤害的效果
	[1603] = {GetSpellInfo(60668), 60668},	--附魔手套 - 碾压 攻击强度提高44点
	[3241] = {GetSpellInfo(44576), 44576},	--附魔武器 - 生命护卫 在命中目标时有一定几率为装备者恢复生命值
	[3239] = {GetSpellInfo(44524), 44524},	--附魔武器 - 破冰 在命中目标时有一定几率附加火焰伤害
	[3297] = {GetSpellInfo(47900), 47900},	--附魔胸甲 - 超级生命 生命值提高275点
	[1147] = {GetSpellInfo(44593), 44593},	--附魔护腕 - 特效精神 精神提高18点
	[1099] = {GetSpellInfo(60663), 60663},	--附魔披风 - 特效敏捷 敏捷提高22点
	[1952] = {GetSpellInfo(44489), 44489},	--附魔盾牌 - 防御 防御等级提高20
	[2381] = {GetSpellInfo(44509), 44509},	--附魔胸甲 - 强效法力回复 每5秒恢复10点法力值
	[3222] = {GetSpellInfo(44529), 44529},	--附魔手套 - 特效敏捷 敏捷提高20点
	[3231] = {GetSpellInfo(44598), 44598},	--附魔护腕 - 精准 精准等级提高15
	[983] = {GetSpellInfo(44589), 44589},	--附魔靴子 - 超强敏捷 敏捷提高16点
	[3234] = {GetSpellInfo(44488), 44488},	--附魔手套 - 精确 命中等级提高20
	[1103] = {GetSpellInfo(44633), 44633},	--附魔武器 - 优异敏捷 敏捷提高26点
	[3844] = {GetSpellInfo(44510), 44510},	--附魔武器 - 优异精神 精神提高45点
	[3245] = {GetSpellInfo(44588), 44588},	--附魔胸甲 - 优异韧性 韧性等级提高20
	[1147] = {GetSpellInfo(44508), 44508},	--附魔靴子 - 强效精神 精神提高18点
	[3231] = {GetSpellInfo(44484), 44484},	--附魔手套 - 精准 精准等级提高15
	[3244] = {GetSpellInfo(44584), 44584},	--附魔靴子 - 强效活力 每5秒恢复7点法力值
	[2661] = {GetSpellInfo(44616), 44616},	--附魔护腕 - 强效属性 所有属性提高6点
	--[3230] = {GetSpellInfo(44483), 44483},	--附魔披风 - 超强冰霜抗性 冰霜抗性提高20点 
	--[1262] = {GetSpellInfo(44596), 44596},	--附魔披风 - 超强奥术抗性 奥术抗性提高20点
	--[1446] = {GetSpellInfo(44590), 44590},	--附魔披风 - 超强暗影抗性 暗影抗性提高20点
	--[1354] = {GetSpellInfo(44556), 44556},	--附魔披风 - 超强火焰抗性 火焰抗性提高20点
	--[1400] = {GetSpellInfo(44494), 44494},	--附魔披风 - 超强自然抗性 自然抗性提高20点 
	[1953] = {GetSpellInfo(47766), 47766},	--附魔胸甲 - 强效防御 防御等级提高22
	[3829] = {GetSpellInfo(44513), 44513},	--附魔手套 - 强效突袭 永久性地为一双手套附魔，使其获得攻击强度提高35点的效果。该装备等级不得低于60级
	[2326] = {GetSpellInfo(44635), 44635},	--附魔护腕 - 强效法术强度 永久性地为一副护腕附魔，使其获得法术强度提高23点的效果。该装备等级不得低于60级
	[983] = {GetSpellInfo(44500), 44500},	--附魔披风 - 超强敏捷 永久性地为一件披风附魔，使其获得敏捷提高16点的效果。该物品等级不得低于60级
	[3830] = {GetSpellInfo(44629), 44629},	--附魔武器 - 优异法术能量 永久性地为一把近战武器附魔，使其获得法术强度提高50点的效果。该装备等级不得低于60级
	[1128] = {GetSpellInfo(60653), 60653},	--附魔盾牌 - 强效智力 永久性地为一面盾牌附魔，使其获得智力提高25点的效果。该装备等级不得低于60级
	[3236] = {GetSpellInfo(44492), 44492},	--附魔胸甲 - 极效生命 永久性地为一件胸甲附魔，使其获得生命值提高200点的效果。该装备等级不得低于60级
	[3828] = {GetSpellInfo(44630), 44630},	--附魔双手武器 - 强效野蛮 永久性地为一把双手近战武器附魔，使其获得攻击强度提高85点的效果。该装备等级不得低于60级
	[3855] = {GetSpellInfo(62959), 62959},	--附魔法杖 - 法术能量 永久性地为一把法杖附魔，使其获得法术强度提高69点的效果。该装备等级不得低于60级
	[3826] = {GetSpellInfo(60623), 60623},	--附魔靴子 - 履冰 永久性地为一双靴子附魔，使其获得爆击等级和命中等级提高12的效果。该装备等级不得低于60级
	[1606] = {GetSpellInfo(60621), 60621},	--附魔武器 - 强效潜能 永久性地为一把近战武器附魔，使其获得攻击强度提高50点的效果。该装备等级不得低于60级
--截止2011.3.10 NGA数据库没有的附魔
	[1075] = {GetSpellInfo(44528), 44528},	--附魔靴子 - 强效坚韧 永久性地为一双靴子附魔，使其获得耐力提高22点的效果。该装备等级不得低于60级
    [3839] = {GetSpellInfo(44645), 44645},  --附魔戒指 - 突袭 攻击强度+40
    [3840] = {GetSpellInfo(44636), 44636},  --附魔戒指 - 强效法术能量 法术强度+23
	[3791] = {GetSpellInfo(59636), 59636},  --附魔戒指 - 耐力 耐力+30
	[3238] = {GetSpellInfo(44506), 44506},  --附魔手套 - 采集 永久性地为一双手套附魔，使其获得草药学、采矿和剥皮技能提高5点的效果

--CTM	
	[4061] = {GetSpellInfo(74132), 74132}, --附魔手套 - 精通 永久性地为一副手套附魔，使其获得精通+50点的效果。该装备等级不得低于300级
	[4062] = {GetSpellInfo(74189), 74189}, --附魔靴子 - 土灵活力 永久性地为一双靴子附魔，使其获得移动速度+8%，耐力+30的效果。该装备等级不得低于300级
	[4063] = {GetSpellInfo(74191), 74191}, --附魔胸甲 - 极效属性  永久性地为一副胸甲附魔，使其获得全部属性数值提高15点的效果。该装备等级不得低于300级
	[4064] = {GetSpellInfo(74192), 74192}, --附魔披风 - 次级能量 永久性地为一件披风附魔，使其获得PvP 强度＋56的效果。该物品等级不得低于300级
	[4065] = {GetSpellInfo(74193), 74193}, --附魔护腕 - 速度 永久性地为一副护腕附魔，使其获得急速+50点的效果。该装备的物品等级不得低于300级
	[4066] = {GetSpellInfo(74195), 74195}, --附魔武器 - 治愈 永久性地为一件武器附魔，使你用法术和近战攻击对敌人造成伤害时偶尔会对你进行治疗。该物品的装备等级不得低于300级
	[4067] = {GetSpellInfo(74197), 74197}, --附魔武器 - 雪崩 永久性地为一件武器附魔，使其偶尔会对一名受到你的法术伤害或近战攻击的敌人造成463~537点自然伤害。该装备的物品等级不得低于300级
	[4068] = {GetSpellInfo(74198), 74198}, --附魔手套 - 急速 永久性地为一副手套附魔，使其获得急速+50点的效果。该装备等级不得低于300级
	[4069] = {GetSpellInfo(74199), 74199}, --附魔靴子 - 急速 永久性地为一双靴子附魔，使其获得急速+50点的效果。该装备等级不得低于300级
	[4070] = {GetSpellInfo(74200), 74200}, --附魔胸甲 - 耐力 永久性地为一副胸甲附魔，使其获得耐力提高55点的效果。该装备等级不得低于300级
	[4071] = {GetSpellInfo(74201), 74201}, --附魔护腕 - 爆击 永久性地为一副护腕附魔，使其获得爆击+50点的效果。该装备等级不得低于300级
	[4072] = {GetSpellInfo(74202), 74202}, --附魔披风 - 智力 永久性地为一件披风附魔，使其获得智力提高30点的效果。该装备等级不得低于300级
	[4073] = {GetSpellInfo(74207), 74207}, --附魔盾牌 - 防护 永久性地为一面盾牌附魔，使其获得耐力值提高16点的效果。该装备等级不得低于300级
	[4074] = {GetSpellInfo(74211), 74211}, --附魔武器 - 元素杀手 永久性地为一件近战武器附魔，使其有时对遭受你近战攻击的元素产生阻扰，造成奥术伤害，并使其沉默5秒。该装备等级不得低于300级
	[4075] = {GetSpellInfo(74212), 74212}, --附魔手套 - 优异力量 永久性地为一副手套附魔，使其获得力量提高35点的效果。该装备等级不得低于300级
	[4076] = {GetSpellInfo(74213), 74213}, --附魔靴子 - 特效敏捷 永久性地为一双靴子附魔，使其获得敏捷提高35点的效果。该装备等级不得低于300级 +35 Agility (Enchant Boots - Major Agility)
	[4077] = {GetSpellInfo(74214), 74214}, --附魔胸甲 - 极效韧性 永久性地为一副胸甲附魔，使其获得韧性+40点的效果。该装备等级不得低于300级+40 Resilience Rating (Enchant Chest - Mighty Resilience)
	[4078] = {GetSpellInfo(74215), 74215}, --+40 Strength (Enchant Ring - Strength)
	[4079] = {GetSpellInfo(74216), 74216}, --+40 Agility (Enchant Ring - Agility)
	[4080] = {GetSpellInfo(74217), 74217}, --+40 Intellect (Enchant Ring - Intellect)
	[4081] = {GetSpellInfo(74218), 74218}, --+60 Stamina (Enchant Ring - Greater Stamina)
	[4082] = {GetSpellInfo(74220), 74220}, --附魔手套 - 强效精准 永久性地为一副手套附魔，使其获得精准+50点的效果。该装备的物品等级不得低于300级+50 Expertise Rating (Enchant Gloves - Greater Expertise)
	[4083] = {GetSpellInfo(74223), 74223}, --附魔武器 - 飓风 永久性地为一把近战武器附魔，使其在治疗或者造成法术和近战伤害时偶尔获得急速+450点的效果，持续12秒。该装备的物品等级不得低于300级Hurricane (Enchant Weapon - Hurricane)
	[4084] = {GetSpellInfo(74225), 74225}, --附魔武器 - 心灵之歌 永久性地为一件武器附魔，使其在用法术进行治疗或造成伤害时偶尔会使你的精神提高200点，持续15秒。该装备的物品等级不得低于300级Heartsong (Enchant Weapon - Heartsong)
	[4085] = {GetSpellInfo(74226), 74226}, --附魔盾牌 - 精通 永久性地为一面盾牌附魔，使其获得精通+50点的效果。该装备等级不得低于300级+40 Block Rating (Enchant Shield - Blocking)
	[4086] = {GetSpellInfo(74229), 74229}, --附魔护腕 - 超强躲闪 永久性地为一副护腕附魔，使其获得躲闪+50点的效果。该装备等级不得低于300级+50 Dodge Rating (Enchant Bracer - Dodge)
	[4087] = {GetSpellInfo(74230), 74230}, --附魔披风 - 爆击 永久性地为一件披风附魔，使其获得爆击+50的效果。该装备等级不得低于300级+50 Critical Strike Rating (Enchant Cloak - Critical Strike)
	[4088] = {GetSpellInfo(74231), 74231}, --附魔胸甲 - 优异精神 永久性地为一件胸甲附魔，使其获得精神提高40点的效果。该装备等级不得低于300级+40 Spirit (Enchant Chest - Exceptional Spirit)
	[4089] = {GetSpellInfo(74232), 74232}, --附魔护腕 - 精确 永久性地为一副护腕附魔，使其获得命中+50点的效果。该装备等级不得低于300级+50 Hit Rating (Enchant Bracer - Precision)
	[4090] = {GetSpellInfo(74234), 74234}, --附魔披风 - 防护 永久性地为一件披风附魔，使其获得耐力值提高30点的效果。该装备等级不得低于300级+250 Armor (Enchant Cloak - Protection)
	[4091] = {GetSpellInfo(74235), 74235}, --附魔副手 - 超强智力 永久性地为一面盾牌或手持物品附魔，使其获得智力提高40点的效果。该装备的物品等级不得低于300级+35 Intellect (Enchant Shield - Superior Intellect)
	[4092] = {GetSpellInfo(74236), 74236}, --附魔靴子 - 精确 永久性地为一双靴子附魔，使其获得命中+50点的效果。该装备等级不得低于300级+50 Hit Rating (Enchant Boots - Precision)
	[4093] = {GetSpellInfo(74237), 74237}, --附魔护腕 - 优异精神 永久性地为一副护腕附魔，使其获得精神提高50点的效果。该装备等级不得低于300级+50 Spirit (Enchant Bracer - Exceptional Spirit)
	[4094] = {GetSpellInfo(74238), 74238}, --附魔靴子 - 精通 永久性地为一双靴子附魔，使其获得精通+50点的效果。该装备等级不得低于300级+50 Mastery Rating (Enchant Boots - Mastery)
	[4095] = {GetSpellInfo(74239), 74239}, --附魔护腕 - 强效精准 永久性地为一副护腕附魔，使其获得精准+50点的效果。该装备等级不得低于300级+50 Expertise Rating (Enchant Bracer - Greater Expertise)
	[4096] = {GetSpellInfo(74240), 74240}, --附魔披风 - 强效智力 永久性地为一件披风附魔，使其获得智力提高50点的效果。该装备等级不得低于300级+50 Intellect (Enchant Cloak - Greater Intellect)
	[4097] = {GetSpellInfo(74242), 74242}, --附魔武器 - 能量洪流 永久性地为一件武器附魔，使其在用法术造成伤害或者进行治疗时偶尔获得智力提高500点的效果，持续12秒。该装备的物品等级不得低于300级Power Torrent (Enchant Weapon - Power Torrent)
	[4098] = {GetSpellInfo(74244), 74244}, --附魔武器 - 风行 永久性地为一件武器附魔，使其有时能在近战攻击时获得躲闪+600和移动速度+15%的效果，持续10秒，能够和被动移动加速效果叠加。该装备等级不得低于300级Windwalk (Enchant Weapon - Windwalk)
	[4099] = {GetSpellInfo(74246), 74246}, --附魔武器 - 山崩 永久性地为一件武器附魔，使其偶尔令你的攻击强度提高1000点，持续12秒。该装备的物品等级不得低于300级Landslide (Enchant Weapon - Landslide)
	[4100] = {GetSpellInfo(74247), 74247}, --附魔披风 - 强效爆击 永久性地为一件披风附魔，使其获得爆击+65点的效果。该装备等级不得低于300级+65 Critical Strike Rating (Enchant Cloak - Greater Critical Strike)
	[4101] = {GetSpellInfo(74248), 74248}, --附魔护腕 - 强效爆击 永久性地为一副护腕附魔，使其获得爆击+65点的效果。该装备等级不得低于300级+65 Critical Strike Rating (Enchant Bracer - Greater Critical Strike)
	[4102] = {GetSpellInfo(74250), 74250}, --附魔胸甲 - 无双属性 永久性地为一副胸甲附魔，使其获得全部属性数值提高20点的效果。该装备等级不得低于300级+20 All Stats (Enchant Chest - Peerless Stats)
	[4103] = {GetSpellInfo(74251), 74251}, --附魔胸甲 - 强效耐力 永久性地为一件胸甲附魔，使其获得耐力+75的效果。该装备等级不得低于300级+75 Stamina (Enchant Chest - Greater Stamina)
	[4104] = {GetSpellInfo(74253), 74253}, --附魔靴子 - 熔岩行者 永久性地为一双靴子附魔，使其获得移动速度+8%，精通+35点的效果。该装备等级不得低于300级+35 Mastery Rating and Minor Movement Speed (Enchant Boots - Lavawalker)
	[4105] = {GetSpellInfo(74252), 74252}, --附魔靴子 - 刺客步伐 永久性地为一双靴子附魔，使其获得移动速度+8%，敏捷+25的效果。该装备等级不得低于300级+25 Agility and Minor Movement Speed (Enchant Boots - Assassin's Step)
	[4106] = {GetSpellInfo(74254), 74254}, --附魔手套 - 极效力量 永久性地为一副手套附魔，使其获得力量提高50点的效果。该装备等级不得低于300级+50 Strength (Enchant Gloves - Mighty Strength)
	[4107] = {GetSpellInfo(74255), 74255}, --附魔手套 - 强效精通 永久性地为一副手套附魔，使其获得精通+65点的效果。该装备等级不得低于300级+65 Mastery Rating (Enchant Gloves - Greater Mastery)
	[4108] = {GetSpellInfo(74256), 74256}, --附魔护腕 - 强效急速 永久性地为一副护腕附魔，使其获得急速+65点的效果。该装备等级不得低于300级+65 Haste Rating (Enchant Bracer - Greater Speed)
	--pp[4109] = {GetSpellInfo(75255), 75255}, --55 Intellect and +45 Spirit (Ghostly Spellthread)
	[4110] = {GetSpellInfo(75310), 75310}, --+60 Intellect and +30 Spirit (Powerful Ghostly Spellthread)
	[4111] = {GetSpellInfo(75250), 75250}, --+55 Intellect and +65 Spirit (Enchanted Spellthread)
	[4112] = {GetSpellInfo(75309), 75309}, --+60 Intellect and +45 Stamina (Powerful Enchanted Spellthread)
	[4113] = {GetSpellInfo(75154), 75154}, --+95 Intellect and +80 Stamina (Master's Spellthread)
	[4114] = {GetSpellInfo(75155), 75155}, --+95 Intellect and +55 Spirit (Sanctified Spellthread)
	[4115] = {GetSpellInfo(75172), 75172}, --Lightweave Embroidery
	[4116] = {GetSpellInfo(75175), 75175}, --Darkglow Embroidery
	[4118] = {GetSpellInfo(75178), 75178}, --Swordguard Embroidery
	[4120] = {GetSpellInfo(78165), 78165}, --+36 Stamina (Savage Armor Kit)
	--pp[4122] = {GetSpellInfo(78419), 78419}, --+110 Attack Power and +45 Critical Strike Rating (Scorched Leg Armor)
	--pp[4124] = {GetSpellInfo(78420), 78420}, --+85 Stamina and +45 Agility (Twilight Leg Armor)
	[4126] = {GetSpellInfo(78171), 78171}, --56550龙鳞腿甲片+190 Attack Power and +55 Critical Strike Rating (Dragonscale Leg Armor)
	[4127] = {GetSpellInfo(78172), 78172}, --56551焦鳞腿甲片+145 Stamina and +55 Agility (Charscale Leg Armor)
	[4175] = 59594, --spell=81932 在弓或枪械上加装永久性的瞄准镜，用远程攻击造成伤害后偶尔可以使远程攻击强度提高800点，持续10秒Gnomish X-Ray Scope (Gnomish X-Ray Scope)
	[4176] = {GetSpellInfo(84408), 84408}, --+88 Hit Rating (R19 Threatfinder)
	[4177] = {GetSpellInfo(84410), 84410}, --+88 Ranged Haste Rating (Safety Catch Removal Kit)
	[4179] = {GetSpellInfo(82175), 82175}, --Synapse Springs
	[4180] = {GetSpellInfo(82177), 82177}, --Quickflip Deflection Plates
	[4181] = {GetSpellInfo(82180), 82180}, --Tazik Shocker
	[4182] = {GetSpellInfo(82200), 82200}, --Spinal Healing Injector
	[4183] = {GetSpellInfo(82201), 82201}, --Z50 Mana Gulper
	[4187] = {GetSpellInfo(84424), 84424}, --Invisibility Field
	[4188] = {GetSpellInfo(84427), 84427}, --Grounded Plasma Shield
	
	[4206] = 62366, --+90 Stamina and 35 Dodge rating (Arcanum of the Earthen Ring)
	[4207] = 62367, --+60 Intellect and 35 Critical Strike rating (Arcanum of Hyjal)
	[4208] = 62422, --+60 Strength and 35 Mastery rating (Arcanum of the Wildhammer - Alliance)
	[4209] = 62369, --+60 Agility and 35 Haste rating (Arcanum of the Ramkahen)
	[4214] = {GetSpellInfo(84425), 84425}, --Cardboard Assassin
	[4215] = {GetSpellInfo(76441), 76441}, --Elementium Spike (90-133) (Elementium Shield Spike)
	[4216] = {GetSpellInfo(76440), 76440}, --55056燃钢盾刺Pyrium Spike (210-350) (Pyrium Shield Spike)
	[4217] = {GetSpellInfo(76442), 76442}, --Pyrium Weapon Chain(原来的不知道对不)
	[4217] = {GetSpellInfo(93448), 93448}, --55057燃钢武器链 2012.9.25添加的 为你的武器附加一条武器链，使缴械效果的持续时间缩短60%，命中提高40点。不与其它同类效果叠加
	[4222] = {GetSpellInfo(67839), 67839}, --Mind Amplification Dish
	[4223] = {GetSpellInfo(55016), 55016}, --氮气推进器 永久性地为你的腰带附加氮气推进器，使你可以极大地提高奔跑速度，持续5秒。它们几乎不会猛烈地爆炸，所以别担心Nitro Boosts
	[4227] = {GetSpellInfo(95471), 95471}, --附魔双手武器 - 极效敏捷 永久性地为一件双手武器附魔，使其获得敏捷提高130点的效果。装备的物品等级必须达到300级或以上+130 Agility (Enchant 2H Weapon - Mighty Agility)
    [4248] = 68772, --spell=96249强效蛮性智力铭文 永久性地为一件肩部装备附魔，使其获得智力+50点，韧性+25点的效果
	[4249] = 68773, --spell=96250强效蛮性力量铭文 永久性地为一件肩部装备附魔，使其获得力量+50点，韧性+25点的效果
	[4250] = 68774, --spell=96251强效蛮性敏捷铭文 永久性地为一件肩部装备附魔，使其获得敏捷+50点，韧性+25点的效果
	[4250] = 68815, --spell=96251残忍角斗士的强效铭文 永久性地为一件肩部装备附魔，使其获得敏捷+50点，韧性+25点的效果
	[4245] = 68770, --spell=96245蛮性智力秘药 智力+60 韧性+35
	[4247] = 68768, --spell=96247蛮性力量秘药 力量+60 韧性+35 
	[4246] = 68769, --spell=96246蛮性敏捷秘药 敏捷+60 韧性+35 
  --塞拉赞恩
    [4197] = 62321, --次级不碎石英铭文+45 Stamina and +20 Dodge Rating (Lesser Inscription of Unbreakable Quartz)
	--2012.9.25改[4198] = 62333, --+75 Stamina and +25 Dodge Rating (Greater Inscription of Unbreakable Quartz)
	[4198] = 68717, --强效不碎石英铭文 永久性地为一件肩部装备附魔，使其获得耐力+75点、躲闪+25点的效果
	[4199] = 62342, --次级充能磁石铭文+30 Intellect and +20 Haste Rating (Lesser Inscription of Charged Lodestone)
	--2012.9.25改[4200] = 62343, --+50 Intellect and +25 Haste Rating (Greater Inscription of Charged Lodestone)
	[4200] = 68715, --spell=86899 强效充能磁石铭文 智力+50 急速+25
	[4201] = 62344, --次级锯缘石铭文+30 Strength and +20 Critical Strike Rating (Lesser Inscription of Jagged Stone)
	--2012.9.25改[4202] = 62345, --+50 Strength and +25 Critical Strike Rating (Greater Inscription of Jagged Stone)
	[4202] = 68716, --强效锯缘石铭文 永久性地为一件肩部装备附魔，使其获得力量+50点、爆击+25点的效果
	--2012.9.25改[4204] = 62346, --+50 Agility and +25 Mastery Rating (Greater Inscription of Shattered Crystal)
	[4204] = 68714, --强效破裂水晶铭文 永久性地为一件肩部装备附魔，使其获得敏捷+50点、精通+25点的效果
	[4205] = 62347, --次级破裂水晶铭文+30 Agility and +20 Mastery Rating (Lesser Inscription of Shattered Crystal)
	
	--2011.3.10添加
	[3243] = {GetSpellInfo(44582), 44582}, --Enchant Cloak - Spell Piercing 
	--原2012.9.25改[846] = {GetSpellInfo(71692), 71692}, --Enchant Gloves - Angler
	[4732] = {GetSpellInfo(71692), 71692}, --附魔手套 - 垂钓 教你学会永久性地为一双手套附魔，使其获得钓鱼技能+5的效果
	--制皮
	[4189] = {GetSpellInfo(85007), 85007}, --龙人雕饰 - 耐力 为你的护腕雕上龙饰，使其获得耐力永久提高195点的效果。 护腕雕饰后将成为灵魂绑定物品。装备者的制皮技能必须高于500点才能获得这个效果。
	[4190] = {GetSpellInfo(85008), 85008}, --龙人雕饰 - 敏捷 为你的护腕雕上龙饰，使其获得敏捷永久提高130点的效果。 护腕雕饰后将成为灵魂绑定物品。装备者的制皮技能必须高于500点才能获得这个效果。
	[4191] = {GetSpellInfo(85009), 85009}, --龙人雕饰 - 力量 为你的护腕雕上龙饰，使其获得力量永久提高130点的效果。 护腕雕饰后将成为灵魂绑定物品。装备者的制皮技能必须高于500点才能获得这个效果。
	[4192] = {GetSpellInfo(85010), 85010}, --龙人雕饰 - 智力 为你的护腕雕上龙饰，使其获得智力永久提高130点的效果。 护腕雕饰后将成为灵魂绑定物品。装备者的制皮技能必须高于500点才能获得这个效果。
	[4127] = 56551, --焦鳞腿甲强化片 永久性地在你的腿部装备上附加焦鳞腿甲强化片，使其获得耐力提高145点、敏捷提高55点的效果
	[4440] = {GetSpellInfo(78171), 78171}, --龙骨腿甲强化片 永久性地在你的腿部装备上附加龙骨腿甲强化片，使其获得攻击强度提高190点、爆击等级提高55的效果
	[4121] = 56517, --重蛮皮护甲片 永久性地为一件头部、胸部、肩部、腿部、手或脚上的装备提供耐力提高44的效果
	[4120] = 56477, --蛮皮护甲片 永久性地为一件头部、胸部、肩部、腿部、手或脚上的装备提供耐力提高36的效果
	[4122] = 56502, --焦毁腿甲 永久性地在腿部装备上添加焦毁甲片，使攻击强度提高110，爆击等级提高45
	[4124] = 56503, --暮光腿甲 永久性地在腿部装备上添加暮光甲片，使耐力提高85，敏捷提高45
	[4270] = 71720, --龙皮腿甲片 永久性地为一件头部、胸部、肩部、腿部、手或脚上的装备提供耐力提高44的效果
	
	--铭文
	[4196] = {GetSpellInfo(86403), 86403}, --邪火铭文 +智力130 +急速25
	[4195] = {GetSpellInfo(86402), 86402}, --大地公主铭文 +耐力195 +躲闪25
	[4194] = {GetSpellInfo(86401), 86401}, --狮鬃铭文 +力量130 暴击25
	[4193] = {GetSpellInfo(86375), 86375}, --迅钢铭文 +敏捷+130 +精通25
	--工程
	[4267] = {GetSpellInfo(99623), 99623}, --弗林特洛克的土拨鼠瞄准镜
	[4256] = {GetSpellInfo(96261), 96261}, --Enchant Bracer - Major Strength
	[4257] = {GetSpellInfo(96262), 96262}, --Enchant Bracer - Mighty Intellect
	[4258] = {GetSpellInfo(96264), 96264}, --Enchant Bracer - Agility
	
	--2012.9.25 MOP
	[4803] = {GetSpellInfo(121192), 121192}, --强效虎牙铭文  永久性地为一件肩部装备附魔，使其获得力量200、爆击+100的效果
	[4804] = {GetSpellInfo(121193), 121193}, --强效虎爪铭文 永久性地为一件肩部装备附魔，使其获得敏捷200、爆击+100的效果
	[4806] = {GetSpellInfo(121195), 121195}, --强效鹤翼铭文 永久性地为一件肩部装备附魔，使其获得智力200、爆击+100的效果
	[4805] = {GetSpellInfo(121194), 121194}, --强效牛角铭文 永久性地为一件肩部装备附魔，使其获得耐力300、躲闪+100的效果
	[4912] = {GetSpellInfo(113048), 113048}, --秘法牛角铭文 永久性地为一件肩部装备附魔，使其获得耐力750、躲闪+100的效果
	[4915] = {GetSpellInfo(113045), 113045}, --秘法鹤翼铭文  永久性地为一件肩部装备附魔，使其获得智力520、爆击+100的效果
	[4916] = {GetSpellInfo(113044), 113044}, --秘法龙珠铭文 永久性地为一件肩部装备附魔，使其获得精神+520、爆击+100的效果
	[4914] = {GetSpellInfo(113046), 113046}, --秘法虎爪铭文 永久性地为一件肩部装备附魔，使其获得敏捷520、爆击+100的效果
	[4913] = {GetSpellInfo(113047), 113047}, --秘法虎牙铭文 永久性地为一件肩部装备附魔，使其获得力量520、爆击+100的效果
	[4824] = 83763, --spell=122386铁鳞腿甲片 永久性地在腿部装备上添加护甲，使耐力提高430点，躲闪提高165点
	[4822] = 83764, --spell=122387影皮腿甲片 永久性地在腿部装备上添加护甲，使敏捷提高285点，爆击提高165点
	
	
	[4880] = 83764, --spell=122387影皮腿甲片 永久性地在腿部装备上添加护甲，使敏捷提高285点，爆击提高165点
	[4823] = 83765, --spell=122388怒皮腿甲片 永久性地在腿部装备上添加护甲，使力量提高285点，爆击提高165点
	[4910] = {GetSpellInfo(127012), 127012}, --牛角铭文 永久性地为一件肩部装备附魔，使其获得耐力180、躲闪80的效果
	[4909] = {GetSpellInfo(127013), 127013}, --鹤翼铭文 永久性地为一件肩部装备附魔，使其获得智力120、爆击80的效果
	[4908] = {GetSpellInfo(127014), 127014}, --虎爪铭文 永久性地为一件肩部装备附魔，使其获得敏捷120、爆击80的效果
	[4907] = {GetSpellInfo(127015), 127015}, --虎牙铭文 永久性地为一件肩部装备附魔，使其获得力量120、爆击80的效果
	[4826] = 82444, --spell=122393强效珠光魔线 永久性地在一件腿部装备上附加一条魔法丝线，使智力提高285点，精神提高165点
	[4825] = 82445, --spell=122392强效蔚蓝魔线 永久性地在一件腿部装备上附加一条魔法丝线，使智力提高285点，爆击提高165点
	[5002] = 90046, --spell=131467===待查===活化钢腰带
	[4918] = 86597, --spell=128286活化钢武器链 为你的武器附加一条武器链，使缴械效果的持续时间缩短60%，精准提高200点。不与其它同类效果叠加
	[5004] = 82442, --spell=131863珠光魔线 永久性地在一件腿部装备上附加一条魔法丝线，使智力提高170点，精神提高100点
	[5003] = 82443, --spell=131862蔚蓝魔线 永久性地在一件腿部装备上附加一条魔法丝线，使智力提高170点，爆击提高100点
	[5001] = 86599, --spell=131464幽冥铁盾刺 为你的盾牌装上幽冥铁盾刺，当你格挡时偶尔会对敌人造成210~350点伤害
	[4872] = 85568, --spell=124119残暴腿甲片 永久性地在腿部装备上附加护甲片，使其获得力量提高170点，爆击提高100点的效果
	[4871] = 85569, --spell=124118萦煞腿甲片 永久性地在腿部装备上附加护甲片，使其获得敏捷提高170点，爆击提高100点的效果
	[4870] = 85570, --spell=124116韧化腿甲片 永久性地在腿部装备上附加护甲片，使其获得耐力提高250点，躲闪提高100点的效果
	[4717] = {GetSpellInfo(110764), 110764}, --附魔武器 - 斗佛
	[5002] = {GetSpellInfo(131467), 131467}, -- ===待查===90046活化钢带扣 永久性地在一条腰带上加装一个活化钢带扣，为其增加一个插槽
	[4869] = 85559, --spell=124091邪煞护甲片 永久性地为一件胸部、肩部、腿部、手部或脚上的装备提供耐力提高150点的效果
	[4110] = 54450, --spelll=75150强能幽灵魔线 永久性地在一件腿部装备上附加一条魔法丝线，使智力提高95点，精神提高55点
	[4441] = {GetSpellInfo(104425), 104425}, --附魔武器 - 风歌 永久性地为一把近战武器附魔，使其在你使用法术或近战攻击造成伤害或治疗时偶尔获得12秒内爆击、急速或精通+1500点的效果。该装备等级不得低于372级
	[4442] = {GetSpellInfo(104427), 104427}, --附魔武器 - 玉魂 永久性地为一把近战武器附魔，使其在你使用法术治疗或造成伤害时偶尔获得智力+1650的效果。如果该效果触发时你的法力值低于25%，还将获得精神+750的效果。该装备等级不得低于372级
	[4443] = {GetSpellInfo(104430), 104430}, --附魔武器 - 元素之力 永久性地为一把近战武器附魔，当你的法术和近战攻击造成伤害时偶尔额外造成2775~3225点元素伤害。该装备等级不得低于372级
	[4444] = {GetSpellInfo(104434), 104434}, --附魔武器 - 舞钢 永久性地为一把近战武器附魔，使其在你造成近战伤害时偶尔获得力量或敏捷+1650的效果。总是选择你最高的属性。该装备等级不得低于372级
	[4445] = {GetSpellInfo(104440), 104440}, --附魔武器 - 巨神像 永久性地为一把近战武器附魔，使你造成伤害的近战攻击偶尔会激活魔古防护法术，为你吸收最多7500点伤害。该装备等级不得低于372级
	[4446] = {GetSpellInfo(104442), 104442}, --附魔武器 - 涓咏 永久性地为一把近战武器附魔，使其在你造成近战伤害时偶尔获得7秒内躲闪+1650点的效果。该装备等级不得低于372级
	[4873] = {GetSpellInfo(57683), 57683},   --毛皮衬垫 - 攻击强度 永久性地为一副护腕附魔，使其获得敏捷57的效果
	[4411] = {GetSpellInfo(104338), 104338}, --附魔护腕 - 精通 永久性地为一副护腕附魔，使其获得精通+170点的效果。该装备等级不得低于372级
	[4412] = {GetSpellInfo(104385), 104385}, --附魔护腕 - 特效躲闪 永久性地为一副护腕附魔，使其获得躲闪+170点的效果。该装备等级不得低于372级
	[4414] = {GetSpellInfo(104389), 104389}, --附魔护腕 - 超级智力 永久性地为一副护腕附魔，使其获得智力+170的效果。该装备等级不得低于372级
	[4415] = {GetSpellInfo(104390), 104390}, --附魔护腕 - 优异力量 永久性地为一副护腕附魔，使其获得力量+170的效果。该装备等级不得低于372级
	[4416] = {GetSpellInfo(104391), 104391}, --附魔护腕 - 强效敏捷 永久性地为一副护腕附魔，使其获得敏捷+170的效果。该装备等级不得低于372级
	[4417] = {GetSpellInfo(104392), 104392}, --附魔胸甲 - 超级韧性 永久性地为一件胸甲附魔，使其获得韧性+200点的效果。该装备等级不得低于372级
	[4418] = {GetSpellInfo(104393), 104393}, --附魔胸甲 - 极效精神 永久性地为一件胸甲附魔，使其获得精神+200的效果。该装备等级不得低于372级
	[4419] = {GetSpellInfo(104395), 104395}, --附魔胸甲 - 辉煌属性 永久性地为一件胸甲附魔，使其获得所有属性+80的效果。该装备等级不得低于372级
	[4420] = {GetSpellInfo(104397), 104397}, --附魔胸甲 - 超强耐力 永久性地为一件胸甲附魔，使其获得耐力+300的效果。该装备等级不得低于372级
	[4421] = {GetSpellInfo(104398), 104398}, --附魔披风 - 精确 永久性地为一件披风附魔，使其获得命中+180点的效果。该装备等级不得低于372级
	[4422] = {GetSpellInfo(104401), 104401}, --附魔披风 - 强效防护 永久性地为一件披风附魔，使其获得耐力值+200的效果。该装备等级不得低于372级
	[4423] = {GetSpellInfo(104403), 104403}, --附魔披风 - 超强智力 永久性地为一件披风附魔，使其获得智力+180的效果。该装备等级不得低于372级
	[4424] = {GetSpellInfo(104404), 104404}, --附魔披风 - 超强爆击 永久性地为一件披风附魔，使其获得爆击+180点的效果。该装备等级不得低于372级
	[4426] = {GetSpellInfo(104407), 104407}, --附魔靴子 - 强效急速 永久性地为一双靴子附魔，使其获得急速+175点的效果。该装备等级不得低于372级
	[4427] = {GetSpellInfo(104408), 104408}, --附魔靴子 - 强效精确 永久性地为一双靴子附魔，使其获得命中+175点的效果。该装备等级不得低于372级
	[4428] = {GetSpellInfo(104409), 104409}, --附魔靴子 - 水上漂 永久性地为一双靴子附魔，使其获得移动速度略微提高和敏捷+140的效果。该装备等级不得低于372级
	[4429] = {GetSpellInfo(104414), 104414}, --附魔靴子 - 熊猫人步法 永久性地为一双靴子附魔，使其获得移动速度略微提高和精通+140点的效果。该装备等级不得低于372级
	[4430] = {GetSpellInfo(104416), 104416}, --附魔手套 - 强效急速 永久性地为一副手套附魔，使其获得急速+170点的效果。该装备等级不得低于372级
	[4431] = {GetSpellInfo(104417), 104417}, --附魔手套 - 超强精准 永久性地为一副手套附魔，使其获得精准+170点的效果。该装备等级不得低于372级
	[4432] = {GetSpellInfo(104419), 104419}, --附魔手套 - 超级力量 永久性地为一双手套附魔，使其获得力量+170的效果。该装备等级不得低于372级
	[4433] = {GetSpellInfo(104420), 104420}, --附魔手套 - 超强精通 永久性地为一副手套附魔，使其获得精通+170点的效果。该装备等级不得低于372级
	[4434] = {GetSpellInfo(104445), 104445}, --附魔副手 - 特效智力 永久性地为一面盾牌或一件副手装备附魔，使其获得智力+165的效果。该装备等级不得低于372级
	[4992] = {GetSpellInfo(130749), 130749}, --附魔护腕 - 优异力量 (Scaling) 永久性地为一副护腕附魔，使其获得力量+170点的效果。低于85级的玩家效果会降低
	[4993] = {GetSpellInfo(130758), 130758}, --附魔盾牌 - 强效招架 永久性地为一面盾牌附魔，使其获得招架+170点的效果。该装备等级不得低于417级
	[4109] = 54449, --spell=75149幽灵魔线 永久性地在一件腿部装备上附加一条魔法丝线，使智力提高55点，精神提高45点
	[3729] = {GetSpellInfo(76168), 76168}, --55054乌钢带扣 永久性地在一条腰带上加装一个乌钢带扣，为其增加一个插槽
	[4124] = 56503, --spell=78170暮光腿甲片 永久性地在腿部装备上添加暮光甲片，使耐力提高85，敏捷提高45
	[3332] = 38378, --spell=50913巨龙鳞腿甲片 永久性地在一件腿部装备上附加一块巨龙鳞腿甲片，使其获得攻击强度+100点、爆击+36点的效果
	--2012.10.12添加
	[4359] = {GetSpellInfo(103461), 103461}, --附魔戒指 - 强效敏捷 +160
	[4360] = {GetSpellInfo(103462), 103462}, --附魔戒指 - 强效智力  +160
	[4361] = {GetSpellInfo(103463), 103463}, --附魔戒指 - 强效耐力 +160
	[4807] = {GetSpellInfo(103465), 103465}, --附魔戒指 - 强效力量 +160
--MOP工程学
	[4700] = 77531, --spell=109093镜面瞄准镜 永久性地在远程武器上加装镜面瞄准镜，当远程攻击造成伤害时，偶尔使你的爆击提高900点，持续10秒
	[4897] = {GetSpellInfo(126392), 126392}, --地精滑翔器 永久性地在一件披风上加装一副特别折叠套件，使你能展开一个地精滑翔器，减缓坠落速度，持续30秒。另外，滑翔器能不断向前推进，并且可以转弯
	[4898] = {GetSpellInfo(126731), 126731}, --神经元弹簧 永久性地在你的手套上加装神经元弹簧，使你获得最高主属性+1920的效果，持续10秒。手套每分钟只能启动一次
	[4697] = {GetSpellInfo(108789), 108789}, --相位指 永久性地在你的手套上加装一套轻便多孔磁心，让你能够部分位移，获得躲闪提高1920点的效果，持续10秒。手套上的这一功能每分钟只能激活1次
	[4698] = {GetSpellInfo(109077), 109077}, --炽燃烟火发射器 永久性地在你的手套上加装一副炽燃烟火发射器，经验丰富的工程师可以使用它对远处的敌人在3秒内造成(0)点火焰伤害。每45秒只能发射一次
	[5000] = {GetSpellInfo(109099), 109099}, --滑水推进器 永久性地为你的腰带附加滑水推进器，使你可以在水上行走并提高你的游泳速度，持续6秒
--2012.10.15添加
	[4699] = 77529, --[爆裂领主的毁灭瞄准镜] 永久性地在远程武器上加装爆裂领主的特制瞄准镜，当远程攻击造成伤害时，偶尔使你的敏捷提高1800点，持续10秒。 
    [4700] = 77531, --[镜面瞄准镜] 永久性地在远程武器上加装镜面瞄准镜，当远程攻击造成伤害时，偶尔使你的爆击提高900点，持续10秒。 

 --MOP裁缝
    [4892] = {GetSpellInfo(125481), 125481}, --亮纹刺绣3 在你的披风上刺绣精巧的闪电花纹，使你在施法时有一定几率获得智力提高2000点的效果，持续15秒
    [4894] = {GetSpellInfo(125483), 125483}, --剑刃刺绣3 在你的披风上绣出魔法花纹，使你的伤害性近战和远程攻击有时可以令你的攻击强度提高4000点，持续15秒
    [4893] = {GetSpellInfo(125482), 125482}, --黑光刺绣3 在你的披风上刺绣魔法花纹，使你在施法时有一定几率获得精神提高3000点的效果，持续15秒
    --2012.10.22添加
	[4895] = {GetSpellInfo(125496), 125496}, --[大师魔线3]自用腿部魔线，智力+285、爆击+165
    [4896] = {GetSpellInfo(125497), 125497}, --[神圣魔线3]自用腿部魔线，智力+285、精神+165

	--2012.10.31添加
	[4880] = {GetSpellInfo(124559), 124559}, --源生腿甲强化片 永久性地在你的腿部装备上附加源生腿甲强化片，使其获得敏捷+285、爆击+165的效果
	[4881] = {GetSpellInfo(124561), 124561}, --龙裔腿甲强化片 永久性地在你的腿部装备上附加源生龙裔强化片，使其获得力量+285、爆击+165的效果
	[4882] = {GetSpellInfo(124563), 124563}, --重型腿甲强化片 永久性地在你的腿部装备上附加重型腿甲强化片，使其获得耐力+430、躲闪+165的效果
	[4879] = {GetSpellInfo(124554), 124554}, --毛皮衬垫 - 力量 永久性地为一副护腕附魔，使其获得力量+500的效果
	[4875] = {GetSpellInfo(124551), 124551}, --毛皮衬垫 - 敏捷 永久性地为一副护腕附魔，使其获得敏捷+500的效果
	[4878] = {GetSpellInfo(124553), 124553}, --毛皮衬垫 - 耐力  永久性地为一副护腕附魔，使其获得耐力+750的效果
	[4877] = {GetSpellInfo(124552), 124552}, --毛皮衬垫 - 智力 永久性地为一副护腕附魔，使其获得智力+500的效果
	--[[	[=] = {GetSpellInfo(=), =}, --
	[=] = {GetSpellInfo(=), =}, --
	[=] = {GetSpellInfo(=), =}, --
	[=] = {GetSpellInfo(=), =}, --
	[=] = {GetSpellInfo(=), =}, --
	[=] = {GetSpellInfo(=), =}, --
	[=] = {GetSpellInfo(=), =}, --
	[=] = {GetSpellInfo(=), =}, --
	[=] = {GetSpellInfo(=), =}, --
	[=] = {GetSpellInfo(=), =}, --
	[=] = {GetSpellInfo(=), =}, --
	[=] = {GetSpellInfo(=), =}, --
]]
	[7000] = 0
}

--Localize functions
local tonumber, GetItemInfo, GetItemGem, select = tonumber, GetItemInfo, GetItemGem, select
local RED_GEM, YELLOW_GEM, BLUE_GEM, META_GEM = RED_GEM, YELLOW_GEM, BLUE_GEM, META_GEM
--local INVTYPE_FEET INVTYPE_WRIST INVTYPE_CLOAK INVTYPE_SHIELD = INVTYPE_FEET INVTYPE_WRIST INVTYPE_CLOAK INVTYPE_SHIELD
local strgsub = string.gsub
local strmatch = string.match
--Localize tooltips
local ItemRefTooltip, GameTooltip = ItemRefTooltip, GameTooltip
local currentGemLinkTable = {}
local currentGemTextureTable = {}
local icon
local lastlink = "None"

JewelTips.BUTTON_SIZE = 30
--if IDCard then
	JewelTips.BUTTON_OFFSETY = -40
--end
JewelTips.QUESTIONMARK_ICON = "Interface\\Icons\\INV_Misc_QuestionMark"
JewelTips.ENCHANT_ICON = "Interface\\Icons\\Spell_Holy_GreaterHeal"

function JewelTips.enchantIDtoLink(JewelID, equipLoc)
	local index = tonumber(JewelID)
	if not index then return nil end

	local item = JewelTips.Jewels[index]
	if type(item) == "table" and item.multi == true then
		item = item[equipLoc]
	end

	if item and item ~= 0 then
		if type(item) == "number" then
			return select(2, GetItemInfo(item)) or item
		else
			return "|cffffd000|Henchant:"..item[2].."|h["..item[1].."]|h|r"
		end
	else
		return -1 * index --index is negated to show that the number is the original enchantID
	end
end

function JewelTips.JewelColor(itemLink)
	local subtype = select(7,GetItemInfo( itemLink ))
	local colorString

	if subtype == BLUE_GEM then
		colorString = "0000ff"
	elseif subtype == RED_GEM then
		colorString = "ff0000"
	elseif subtype == YELLOW_GEM then
		colorString = "ffff00"
	elseif subtype == "紫色" then
		colorString = "8000ff"
	elseif subtype == "橙色" then
		colorString = "ff8040"
	elseif subtype == "绿色" then
		colorString = "00ff00"
	elseif subtype == META_GEM then
		colorString = "aaaaaa"
	else
		colorString = "ffffff"
	end

	return " (|cff"..colorString..subtype.."|r)"
end

-- Shared Button Functions
local function gemButton_OnClick(self)
	if IsShiftKeyDown() then
		if WIM_EditBoxInFocus then
			WIM_EditBoxInFocus:Insert(self.link);
		elseif ChatFrame1EditBox:IsVisible() then
			ChatFrame1EditBox:Insert(self.link);
		end
	end
end

--This function is only used for gemButtons not used for the enchantButton
local function gemButton_OnEnter(self)
	if self.link then
		local linknum = tonumber(self.link)
		if (not linknum) then
			--self.link is an itemLink
			GameTooltip:SetOwner(self, JewelTips.TOOLTIP_ANCHOR, JewelTips.TOOLTIP_ANCHOR_OFFSETX, JewelTips.TOOLTIP_ANCHOR_OFFSETY)
			GameTooltip:SetHyperlink(self.link)
			GameTooltip:Show()
		elseif (linknum > 0) then
			--self.link is an itemID
			GameTooltip:SetOwner(self, JewelTips.TOOLTIP_ANCHOR, JewelTips.TOOLTIP_ANCHOR_OFFSETX, JewelTips.TOOLTIP_ANCHOR_OFFSETY)
			GameTooltip:SetHyperlink("item:"..self.link)
			GameTooltip:Show()
		end
	end
end
--/script JewelTips.MoveButtons("top")
local enchantButton = CreateFrame("Button",nil,ItemRefTooltip)
local gem1Button = CreateFrame("Button",nil,ItemRefTooltip)
local gem2Button = CreateFrame("Button",nil,ItemRefTooltip)
local gem3Button = CreateFrame("Button",nil,ItemRefTooltip)

local gemButtonTable = {enchantButton, gem1Button, gem2Button, gem3Button}

for index, gemButton in pairs(gemButtonTable) do
	gemButton:SetWidth(JewelTips.BUTTON_SIZE)
	gemButton:SetHeight(JewelTips.BUTTON_SIZE)
	gemButton:SetScript("OnClick", gemButton_OnClick)
	gemButton:SetScript("OnEnter", gemButton_OnEnter)
	gemButton:SetScript("OnLeave", function() GameTooltip:Hide() end)
	gemButton.gemIndex = index - 1
	gemButton:Hide()
end

local function ClearButtons()
	for _, gemButton in pairs(gemButtonTable) do
		gemButton:Hide()
	end
end

function JewelTips:MoveButtons(side)
	if side == "top" then
		self.TOOLTIP_ANCHOR = "ANCHOR_TOPLEFT"
		self.TOOLTIP_ANCHOR_OFFSETX = 0
		self.TOOLTIP_ANCHOR_OFFSETY = 0
		for index, gemButton in pairs(gemButtonTable) do
			gemButton:ClearAllPoints()
			gemButton:SetPoint("BOTTOMLEFT", ItemRefTooltip, "TOPLEFT", 2+(self.BUTTON_SIZE * (index-1)), 0 )
		end
	elseif side == "bottom" then
		self.TOOLTIP_ANCHOR = "ANCHOR_BOTTOMRIGHT"
		self.TOOLTIP_ANCHOR_OFFSETX = -1*(self.BUTTON_SIZE+2)
		self.TOOLTIP_ANCHOR_OFFSETY = 0
		for index, gemButton in pairs(gemButtonTable) do
			gemButton:ClearAllPoints()
			gemButton:SetPoint("TOPLEFT", ItemRefTooltip, "BOTTOMLEFT", 2+(self.BUTTON_SIZE * (index-1)), 0 )
		end
	elseif side == "left" then
		self.TOOLTIP_ANCHOR = "ANCHOR_BOTTOMLEFT"
		self.TOOLTIP_ANCHOR_OFFSETX = 0
		self.TOOLTIP_ANCHOR_OFFSETY = self.BUTTON_SIZE+2
		for index, gemButton in pairs(gemButtonTable) do
			gemButton:ClearAllPoints()
			gemButton:SetPoint("TOPRIGHT", ItemRefTooltip, "TOPLEFT", 0, self.BUTTON_OFFSETY - (self.BUTTON_SIZE * (index-1)) )
		end
	elseif side == "right" then
		self.TOOLTIP_ANCHOR = "ANCHOR_BOTTOMRIGHT"
		self.TOOLTIP_ANCHOR_OFFSETX = 0
		self.TOOLTIP_ANCHOR_OFFSETY = self.BUTTON_SIZE+2
		for index, gemButton in pairs(gemButtonTable) do
			gemButton:ClearAllPoints()
			gemButton:SetPoint("TOPLEFT", ItemRefTooltip, "TOPRIGHT", 0, self.BUTTON_OFFSETY - (self.BUTTON_SIZE *(index-1)) )
		end
	end
end

JewelTips:MoveButtons("left")

--Main Routine------------------------------------------
local function addEnchantLines(tooltip, link)
	--For some tooltips, this Main function will be called continuously. This code keeps us from doing unnecessary work after the first time.
	if link ~= lastlink then--Reuse data from the last call since the tooltip link is the same
		currentGemLinkTable[1], currentGemLinkTable[2], currentGemLinkTable[3], currentGemLinkTable[4] = string.match(link, "item:%d+:(%d+):(%d+):(%d+):(%d+):")

		for index, gemLink in pairs(currentGemLinkTable) do
			if gemLink == "0" then
				currentGemLinkTable[index] = nil
			else
				--Check for an item corresponding to the enchantID
				if index == 1 then
					currentGemLinkTable[1] = JewelTips.enchantIDtoLink(gemLink, select(9, GetItemInfo(link)))
				else
					local newGemLink = select(2,GetItemGem(link, gemButtonTable[index].gemIndex))
					if newGemLink then
						currentGemLinkTable[index] = newGemLink
						currentGemTextureTable[index] = GetItemIcon( currentGemLinkTable[index] )
					else
						currentGemLinkTable[index] = gemLink
						currentGemTextureTable[index] = JewelTips.QUESTIONMARK_ICON
					end
				end
			end
		end
		lastlink = link
	end

	--Add tooltip lines
	for index, gemLink in pairs(currentGemLinkTable) do
		if index == 1 then
			if type(gemLink) == "number" then
				if gemLink < 0 then
					tooltip:AddLine( string.format("[未知附魔: %d]".." (|cffffffff".."附魔".."|r)", -1 * gemLink) )
				else
					tooltip:AddLine( string.format("[未知物品: %d]".." (|cffffffff".."附魔".."|r)", gemLink) )
					lastlink = "None"
				end
				tooltip:AddTexture(JewelTips.QUESTIONMARK_ICON)
			else
				tooltip:AddLine( gemLink .. " (|cffffffff".."附魔".."|r)")
				if strmatch( gemLink, "Henchant:" ) then
					tooltip:AddTexture(JewelTips.ENCHANT_ICON)
				else
					tooltip:AddTexture(GetItemIcon(gemLink) or JewelTips.QUESTIONMARK_ICON)
				end
			end
		else
			if tonumber(gemLink) then
				lastlink = "None"
			else
				tooltip:AddLine(gemLink .. JewelTips.JewelColor(gemLink))
				tooltip:AddTexture(currentGemTextureTable[index])
			end
		end
	end

	tooltip:Show()
end

local function updateItemRefButtons(link)
	--Show/Hide the Buttons for each Gem
	for index, gemButton in pairs(gemButtonTable) do
		gemButton.link = currentGemLinkTable[index]
		if gemButton.link then
			if type(gemButton.link) == "number" then
				gemButton:SetNormalTexture(JewelTips.QUESTIONMARK_ICON)
			else
				icon = select( 10, GetItemInfo( gemButton.link ) )
				gemButton:SetNormalTexture(icon or JewelTips.ENCHANT_ICON)
			end
			gemButton:Show()
		else
			gemButton:Hide()
		end
	end
end

--Thanks to Tekkub for his beautifully simple tekKompare code from which some of this is borrowed
local Orig_GameTooltip_OnTooltipSetItem = GameTooltip:GetScript("OnTooltipSetItem")
GameTooltip:SetScript("OnTooltipSetItem", function(tooltip, ...)
	assert(tooltip, "arg 1 is nil, someone isn't hooking correctly")

	local _, link = tooltip:GetItem()

	--Check if the tooltip is one of our Jewel tooltips
	for _, gemButton in pairs(gemButtonTable) do
		if tooltip:IsOwned(gemButton) then
			-- If we're setting the link for our enchantbutton, check that the icon is good
			local linknum = tonumber(gemButton.link)
			if (linknum and linknum > 0) then
				local _, itemRefItem = ItemRefTooltip:GetItem()
				ItemRefTooltip:ClearLines()
				SetItemRef(itemRefItem)
				addEnchantLines(ItemRefTooltip, link)
				ItemRefTooltip:Show()
				_, gemButton.link, _, _, _, _, _, _, _, icon = GetItemInfo( linknum )
				gemButton:SetNormalTexture(icon)
			end
			return Orig_GameTooltip_OnTooltipSetItem(tooltip, ...)
		end
	end

--	if not ShoppingTooltip1:IsVisible() then SetTips(link, frame, ShoppingTooltip1, ShoppingTooltip2) end
	if link then
		addEnchantLines(tooltip, link)
	end
	if Orig_GameTooltip_OnTooltipSetItem then return Orig_GameTooltip_OnTooltipSetItem(tooltip, ...) end
end)

local Orig_ItemRefTooltip_OnTooltipSetItem = ItemRefTooltip:GetScript("OnTooltipSetItem")
ItemRefTooltip:SetScript("OnTooltipSetItem", function(tooltip, ...)
	assert(tooltip, "arg 1 is nil, someone isn't hooking correctly")

	local _, link = tooltip:GetItem()
	if link then
		addEnchantLines(tooltip, link)
		updateItemRefButtons(link)
--	else
--		ClearButtons()
	end
	if Orig_ItemRefTooltip_OnTooltipSetItem then return Orig_ItemRefTooltip_OnTooltipSetItem(tooltip, ...) end
end)

local Orig_ItemRefTooltip_OnTooltipCleared = ItemRefTooltip:GetScript("OnTooltipCleared")
ItemRefTooltip:SetScript("OnTooltipCleared", function(...)
	ClearButtons()

	if Orig_ItemRefTooltip_OnTooltipCleared then return Orig_ItemRefTooltip_OnTooltipCleared(...) end
end)
