----------------
--  命名空间  --
----------------

local _, SR = ...
local cfg = SR.RDConfig


cfg.ClassBuffList = {
	["DRUID"] = {
		-- 平衡
		[1] = {
			
		},
		-- 野性战斗
		[2] = {
			
		},
		-- 守护者
		[3] = {
			
		},
		-- 恢复
		[4] = {
			
		},
	},
	
	["MAGE"] = {
		-- 奥术
		[1] = {
			-- 分组 1
			[1] = {
				7302,  -- 霜甲术
				6117,  -- 法师护甲
				30482, -- 熔岩护甲	
			},
		},
		-- 火焰
		[2] = {
			-- 分组 1
			[1] = {
				7302,  -- 霜甲术
				6117,  -- 法师护甲
				30482, -- 熔岩护甲	
			},			
		},
		-- 冰霜
		[3] = {
			-- 分组 1
			[1] = {
				7302,  -- 霜甲术
				6117,  -- 法师护甲
				30482, -- 熔岩护甲	
			},			
		},
	},
	
	["HUNTER"] = {
		-- 野兽控制
		[1] = {
			-- 分组 1
			[1] = {
				13165, -- 雄鹰守护
				109260,  -- 猎豹守护
			},
		},
		-- 射击
		[2] = {
			-- 分组 1
			[1] = {
				13165, -- 雄鹰守护
				109260,  -- 猎豹守护
			},			
		},
		-- 生存
		[3] = {
			-- 分组 1
			[1] = {
				13165, -- 雄鹰守护
				109260,  -- 猎豹守护
			},			
		},
	},
	
	["PRIEST"] = {
		-- 戒律
		[1] = {
			-- 分组 1
			[1] = {
				588,   -- 心灵之火
				73413, -- 心灵意志
			},
		},
		-- 神圣
		[2] = {
			-- 分组 1
			[1] = {
			    588,   -- 心灵之火
				73413, -- 心灵意志
			},		
		},
		-- 暗影
		[3] = {
			-- 分组 1
			[1] = {
				588,   -- 心灵之火
				73413, -- 心灵意志
			},		
		},
	},
	
	["ROGUE"] = {
		-- 刺杀
		[1] = {
		
		},
		-- 战斗
		[2] = {
			
		},
		-- 敏锐
		[3] = {
			
		},
	},
	
	["SHAMAN"] = {
		-- 元素战斗
		[1] = {
			-- 分组 1
			[1] = {
				52127, -- 水之护盾
				324,   -- 闪电之盾
			},
		},
		-- 增强
		[2] = {
			-- 分组 1
			[1] = {
				52127, -- 水之护盾
				324,   -- 闪电之盾
			},			
		},
		-- 恢复
		[3] = {
			-- 分组 1
			[1] = {
				52127, -- 水之护盾
				324,   -- 闪电之盾
			},			
		},
	},
	
	["PALADIN"] = {
		-- 神圣
		[1] = {
			-- 分组 1
			[1] = {
				20154, -- 正义圣印
				20164, -- 公正圣印
				20165, -- 洞察圣印
				31801, -- 真理圣印
			},
		},
		-- 防护
		[2] = {
			-- 分组 1
			[1] = {
				  25780, -- 正义之怒
			},	
			-- 分组 2
			[2] = {
				20154, -- 正义圣印
				20164, -- 公正圣印
				20165, -- 洞察圣印
				31801, -- 真理圣印
			},
		},
		-- 惩戒
		[3] = {
			-- 分组 1
			[1] = {
				20154, -- 正义圣印
				20164, -- 公正圣印
				20165, -- 洞察圣印
				31801, -- 真理圣印
			},	
		},
	},
	
	["WARLOCK"] = {
		-- 痛苦
		[1] = {

		},
		-- 恶魔学识
		[2] = {
		
		},
		-- 毁灭
		[3] = {
	
		},
	},
	
	["DEATHKNIGHT"] = {
		-- 鲜血
		[1] = {
			-- 分组 1
			[1] = {
				48263, -- 鲜血灵气
			},
			-- 分组 2
			[2] = {
				57330, -- 寒冬号角
				 6673, -- 战斗怒吼
				19506, -- 强击光环		
			},			
		},
		-- 冰霜
		[2] = {
			-- 分组 1
			[1] = {
				48265, -- 邪恶灵气
				48266, -- 冰霜灵气
			},
			-- 分组 2
			[2] = {
				57330, -- 寒冬号角
				 6673, -- 战斗怒吼
				19506, -- 强击光环		
			},				
		},
		-- 邪恶
		[3] = {
			-- 分组 1
			[1] = {
				48265, -- 邪恶灵气
				48266, -- 冰霜灵气
			},
			-- 分组 2
			[2] = {
				57330, -- 寒冬号角
				 6673, -- 战斗怒吼
				19506, -- 强击光环		
			},				
		},
	},
	
	["WARRIOR"] = {
		-- 武器
		[1] = {
			-- 分组 1
			[1] = {
				 6673, -- 战斗怒吼
				57330, -- 寒冬号角
				19506, -- 强击光环		
			},
		},
		-- 狂怒
		[2] = {
			-- 分组 1
			[1] = {
				 6673,-- 战斗怒吼
				57330, -- 寒冬号角
				19506, -- 强击光环		
			},			
		},
		-- 防护
		[3] = {
			-- 分组 1
			[1] = {
				  469, -- 命令怒吼
				 6307, -- 血之契印
				90364, -- 其拉虫群坚韧
				72590, -- 坚韧
				21562, -- 真言术：韧
			},			
		},
	},
	
	["MONK"] = {
		[1] = {	-- Legacy of the Emperor group
			
		},
		[2] = {	-- Legacy of the White Tiger group
		
			[1] = {
				116781,	-- Legacy of the White Tiger
				1459,	-- Arcane Brilliance
				61316,	-- Dalaran Brilliance
				24932,	-- Leader of the Pack
				90309,	-- Terrifying Roar
				24604,	-- Furious Howl
			},
		},
		[3] = {	
			
		},
	},
}

SR.RDConfig.ClassBuffList = cfg.ClassBuffList