----------------
--  命名空间  --
----------------

local _, SR = ...
local cfg = SR.RDConfig


cfg.BuffList = {

	[1] = {
		-- 合剂
		105689, --春华合剂
		105691, --暖阳合剂
		105693, --秋叶合剂
		105694, --大地合剂
		105696, --冬噬合剂
    	94160, -- 流水合剂
    	79469, -- 钢皮合剂
    	79470, -- 神龙心智合剂
    	79471, -- 风行合剂
    	79472, -- 泰坦之力合剂
    	79638, -- 增强力量
    	79639, -- 增强敏捷
    	79640, -- 增强智力
		-- 战斗药剂
		79481, -- 命中(无限精准药剂)
		79632, -- 急速(狂速药剂)
		79477, -- 暴击(眼镜蛇药剂)
		79635, -- 精通(大师药剂)
		79474, -- 精准(纳迦药剂)
		79468, -- 精神(幽魂药剂)
		105682, -- 疯狂猢狲药剂
		105683, -- 神兵药剂
		105684, -- 激流药剂
		105685, -- 安宁药剂
		105686, -- 完美药剂
		105687, -- 镜面药剂
		105688, -- 武僧药剂
		-- 守护药剂
		105681, -- 螳螂妖药剂
		79480, -- 900 护甲
		79631, -- 90 全抗性	
	},
	
	[2] = {		
		-- 食物
		124210,
		124211,
		124212,
		124213,
		124214,
		124215,
		124216,
		124217,
		124218,
		124219,
		124220,
		124221,
		87545, -- 90 力量
		87546, -- 90 敏捷
		87547, -- 90 智力
		87548, -- 90 精神
		87549, -- 90 精通
		87550, -- 90 命中
		87551, -- 90 暴击
		87552, -- 90 急速
		87554, -- 90 躲闪
		87555, -- 90 招架
		87635, -- 90 精准		
	},
	
	[3] = {
		-- 全属性
		20217, -- 王者祝福
		1126,  -- 野性印记
		90363, -- 页岩蛛之拥
		115921, -- 帝王传承
	},
	
	[4] = {
		-- 耐力
		21562, -- 真言术：韧
		469,   -- 命令怒吼
		109773,   -- 黑暗意图
		90364, -- 其拉虫群坚韧
		72590, -- 坚韧	
	},
	
	[5] = {
		-- 暴击
		17007, -- 兽群领袖
		1459,  -- 奥术光辉
		61316, -- 达拉然光辉
		116781, -- 白虎传承
		97229, -- 低吼
		24604, -- 狂怒之嚎
		126309, -- 净水
		90309, -- 惊人咆哮
		126373, -- 无畏之嚎
	},
	
	[6] = {
		-- 精通
		19740, -- 力量祝福
		116956, -- 风之优雅
		93435, -- 勇气咆哮
		128997, -- 灵魂兽祝福
	},
	
	[7] = {
		-- 攻击强度
		57330, -- 寒冬号角
		19506, -- 强击光环
		6673, -- 战斗怒吼
	},
	
	[8] = {
		-- 攻击速度
		55610, --邪恶光环
		113742, -- 迅刃之黠
		30809, --怒火释放
		128432, -- 尖声嚎叫
		128433, -- 蛇之迅捷
	},
	
	[9] = {
		-- 法术强度
		61316, -- 达拉然光辉
		1459, -- 奥术智慧
		126309, --净水
		109773, --黑暗意图
	},
	
	[10] = {
		-- 法术急速
		24907, -- 枭兽光环
		15473, -- 暗影形态
	},
}

SR.RDConfig.BuffList = cfg.BuffList